[
  {
    "name": "Ab Wheel",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "abwheel.png",
    "image_detail": "abwheel-detail.jpg",
    "description": [
      "Kneel on the ground and hold the ab wheel handles with your hands directly beneath your shoulders.",
      "Keep your core engaged and your back straight.",
      "Slowly roll the ab wheel forward while extending your arms, maintaining a straight body position.",
      "Engage your core to pull the ab wheel back to the starting position.",
      "Perform the rolling out and returning motion for desired reps.",
      "Exhale as you roll out, inhale as you return.",
      "Avoid arching your back or letting your hips sag."
    ]
  },
  {
    "name": "Arnold Press",
    "category": "Shoulders",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "arnoldpressdb.png",
    "image_detail": "arnoldpressdb-detail.jpg",
    "description": [
      "Sit on a bench with back support, holding a dumbbell in each hand at shoulder height.",
      "Palms facing your body, elbows bent at 90 degrees.",
      "Rotate your palms outward as you press the dumbbells overhead until arms are fully extended.",
      "Reverse the motion and rotate your palms back to the starting position.",
      "Perform the pressing and lowering motion for desired reps.",
      "Exhale as you press the dumbbells up, inhale as you lower.",
      "Keep your back against the bench and avoid leaning back."
    ]
  },
  {
    "name": "Around The World",
    "category": "Chest",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "aroundtheworld.png",
    "image_detail": "aroundtheworld-detail.jpg",
    "description": [
      "Lie on your back on a bench, holding a dumbbell in each hand above your chest.",
      "Palms facing each other, arms fully extended.",
      "Lower the dumbbells in a wide arc to the sides until they're parallel to the ground.",
      "Lift the dumbbells back to the starting position by reversing the circular motion.",
      "Perform the circular motion for desired reps.",
      "Exhale as you lower the dumbbells, inhale as you lift.",
      "Control the weights throughout the motion, avoid jerky movements."
    ]
  },
  {
    "name": "Back Extension",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "backextension.png",
    "image_detail": "backextension-detail.jpg",
    "description": [
      "Position yourself on a back extension bench with your hips against the pad and your upper body hanging off the edge.",
      "Cross your arms over your chest and keep your back straight.",
      "Use your lower back muscles to lift your upper body until it's parallel to the ground.",
      "Lower your upper body back down to the starting position.",
      "Perform the extension and return motion for desired reps.",
      "Exhale as you lift, inhale as you lower.",
      "Avoid using momentum, focus on using your lower back muscles."
    ]
  },
  {
    "name": "Back Extension",
    "category": "Back",
    "equipment": "Machine",
    "type": "weight",
    "image": "backextensionmachine.png",
    "image_detail": "backextensionmachine-detail.jpg",
    "description": [
      "Adjust the machine so that the pad is against your hips and your upper body is free to move.",
      "Cross your arms over your chest and keep your back straight.",
      "Use your lower back muscles to lift your upper body until it's parallel to the ground.",
      "Lower your upper body back down to the starting position.",
      "Perform the extension and return motion for desired reps.",
      "Exhale as you lift, inhale as you lower.",
      "Avoid using momentum, focus on using your lower back muscles."
    ]
  },
  {
    "name": "Ball Slams",
    "category": "Full Body",
    "equipment": "",
    "type": "weight",
    "image": "ballslams.png",
    "image_detail": "ballslams-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart, holding a medicine ball with both hands above your head.",
      "Engage your core and keep your back straight.",
      "Throw the medicine ball forcefully towards the ground, using your core and upper body strength.",
      "Catch the rebounding ball and lift it overhead again.",
      "Perform the slamming and retrieving motion for desired reps.",
      "Exhale as you slam the ball, inhale as you retrieve.",
      "Use your core muscles to generate power, avoid using just your arms."
    ]
  },
  {
    "name": "Battle Ropes",
    "category": "Full Body",
    "equipment": "",
    "type": "time",
    "image": "battleropes.png",
    "image_detail": "battleropes-detail.jpg",
    "description": [
      "Hold the ends of battle ropes with both hands, feet shoulder-width apart.",
      "Stand with a slight bend in your knees and your core engaged.",
      "Create waves in the ropes by moving your arms up and down in an alternating fashion.",
      "Vary the speed and size of the waves for different effects.",
      "Perform the waving motion for desired time or reps.",
      "Maintain steady breathing throughout the exercise.",
      "Use your entire body, not just your arms, to create the waves."
    ]
  },
  {
    "name": "Bench Dip",
    "category": "Triceps",
    "equipment": "",
    "type": "weight",
    "image": "benchdip.png",
    "image_detail": "benchdip-detail.jpg",
    "description": [
      "Sit on the edge of a bench, place your hands next to your hips with fingers facing forward.",
      "Slide your hips off the bench, keeping your knees bent and your feet flat on the ground.",
      "Lower your body by bending your elbows until your upper arms are parallel to the ground.",
      "Push your body back up to the starting position by extending your elbows.",
      "Perform the dipping and pushing motion for desired reps.",
      "Exhale as you push up, inhale as you lower.",
      "Avoid letting your shoulders shrug or your elbows flare out."
    ]
  },
  {
    "name": "Bench Press",
    "category": "Chest",
    "equipment": "Barbell",
    "type": "weight",
    "image": "benchpressbb.png",
    "image_detail": "benchpressbb-detail.jpg",
    "description": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grip the barbell slightly wider than shoulder-width apart, with palms facing away from you.",
      "Unrack the bar and lower it to your chest in a controlled manner while keeping your elbows at around 45 degrees.",
      "Push the barbell back up to the starting position by extending your arms.",
      "Perform the pressing and lowering motion for desired reps.",
      "Exhale as you press the bar up, inhale as you lower it.",
      "Ensure a stable arch in your lower back and avoid bouncing the bar off your chest."
    ]
  },
  {
    "name": "Bench Press",
    "category": "Chest",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "benchpressdb.png",
    "image_detail": "benchpressdb-detail.jpg",
    "description": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Hold a dumbbell in each hand above your chest, palms facing forward.",
      "Lower the dumbbells to your chest in a controlled manner while keeping your elbows at around 45 degrees.",
      "Push the dumbbells back up to the starting position by extending your arms.",
      "Perform the pressing and lowering motion for desired reps.",
      "Exhale as you press the dumbbells up, inhale as you lower them.",
      "Maintain stability and control throughout the exercise."
    ]
  },
  {
    "name": "Bench Press",
    "category": "Chest",
    "equipment": "Cable",
    "type": "weight",
    "image": "benchpresscable.png",
    "image_detail": "benchpresscable-detail.jpg",
    "description": [
      "Attach a straight bar to a low cable pulley and lie on a bench facing away from the pulley.",
      "Hold the bar with an overhand grip and your hands slightly wider than shoulder-width apart.",
      "Lower the bar to your chest while keeping your elbows at around 45 degrees.",
      "Push the bar back up to the starting position by extending your arms.",
      "Perform the pressing and lowering motion for desired reps.",
      "Exhale as you press the bar up, inhale as you lower it.",
      "Maintain stability on the bench and avoid arching your back excessively."
    ]
  },
  {
    "name": "Bench Press - Close Grip",
    "category": "Chest",
    "equipment": "Barbell",
    "type": "weight",
    "image": "benchpressclosegripbb.png",
    "image_detail": "benchpressclosegripbb-detail.jpg",
    "description": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grip the barbell with your hands placed close together, around 6-8 inches apart.",
      "Unrack the bar and lower it to your chest in a controlled manner while keeping your elbows close to your body.",
      "Push the barbell back up to the starting position by extending your arms.",
      "Perform the pressing and lowering motion for desired reps.",
      "Exhale as you press the bar up, inhale as you lower it.",
      "Keep your elbows tucked and avoid flaring them out."
    ]
  },
  {
    "name": "Bench Press - Wide Grip",
    "category": "Chest",
    "equipment": "Barbell",
    "type": "weight",
    "image": "benchpresswidegrip.png",
    "image_detail": "benchpresswidegrip-detail.jpg",
    "description": [
      "Lie flat on a bench with your feet flat on the ground and your back pressed against the bench.",
      "Grip the barbell with your hands placed wider than shoulder-width apart.",
      "Unrack the bar and lower it to your chest in a controlled manner while keeping your elbows at around 45 degrees.",
      "Push the barbell back up to the starting position by extending your arms.",
      "Perform the pressing and lowering motion for desired reps.",
      "Exhale as you press the bar up, inhale as you lower it.",
      "Ensure a stable arch in your lower back and maintain control of the barbell."
    ]
  },
  {
    "name": "Bent Over Row",
    "category": "Back",
    "equipment": "Barbell",
    "type": "weight",
    "image": "bentoverrowbb.png",
    "image_detail": "bentoverrowbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart, holding a barbell with an overhand grip.",
      "Bend at your hips while keeping your back straight, allowing the barbell to hang in front of you.",
      "Pull the barbell towards your lower ribs by retracting your shoulder blades and bending your elbows.",
      "Lower the barbell back down in a controlled manner to the starting position.",
      "Perform the rowing motion for desired reps.",
      "Exhale as you pull the barbell, inhale as you lower it.",
      "Keep your core engaged and avoid rounding your back."
    ]
  },
  {
    "name": "Bent Over Row",
    "category": "Back",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "bentoverrowdb.png",
    "image_detail": "bentoverrowdb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with palms facing your body.",
      "Bend at your hips while keeping your back straight, allowing the dumbbells to hang in front of you.",
      "Pull the dumbbells towards your lower ribs by retracting your shoulder blades and bending your elbows.",
      "Lower the dumbbells back down in a controlled manner to the starting position.",
      "Perform the rowing motion for desired reps.",
      "Exhale as you pull the dumbbells, inhale as you lower them.",
      "Maintain proper posture and avoid using momentum."
    ]
  },
  {
    "name": "Bent Over Row",
    "category": "Back",
    "equipment": "Band",
    "type": "weight",
    "image": "bentoverrowband.png",
    "image_detail": "bentoverrowband-detail.jpg",
    "description": [
      "Anchor a resistance band securely to a fixed point and hold the other end in both hands.",
      "Bend at your hips while keeping your back straight, creating tension in the band.",
      "Pull the band towards your lower ribs by retracting your shoulder blades and bending your elbows.",
      "Slowly release the tension and return to the starting position.",
      "Perform the rowing motion for desired reps.",
      "Exhale as you pull the band, inhale as you release.",
      "Maintain a neutral spine and controlled movements."
    ]
  },
  {
    "name": "Bent Over Row - Underhand",
    "category": "Back",
    "equipment": "Barbell",
    "type": "weight",
    "image": "bentoverrowunderhandbb.png",
    "image_detail": "bentoverrowunderhandbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart, holding a barbell with an underhand grip (palms facing you).",
      "Bend at your hips while keeping your back straight, allowing the barbell to hang in front of you.",
      "Pull the barbell towards your lower ribs by retracting your shoulder blades and bending your elbows.",
      "Lower the barbell back down in a controlled manner to the starting position.",
      "Perform the rowing motion for desired reps.",
      "Exhale as you pull the barbell, inhale as you lower it.",
      "Focus on keeping your chest up and shoulders down."
    ]
  },
  {
    "name": "Bicep Curl",
    "category": "Biceps",
    "equipment": "Machine",
    "type": "weight",
    "image": "bicepcurlmachine.png",
    "image_detail": "bicepcurlmachine-detail.jpg",
    "description": [
      "Sit down at a bicep curl machine and adjust the seat and arm pad to your height.",
      "Grasp the handles with an underhand grip and fully extend your arms.",
      "Curl the handles towards your shoulders while keeping your upper arms stationary.",
      "Squeeze your biceps at the top of the movement, then lower the handles back down.",
      "Perform the curling motion for desired reps.",
      "Exhale as you curl the handles, inhale as you extend your arms.",
      "Avoid using momentum and ensure proper form."
    ]
  },
  {
    "name": "Bicep Curl",
    "category": "Biceps",
    "equipment": "EZ Bar",
    "type": "weight",
    "image": "ezbarcurl.png",
    "image_detail": "ezbarcurl-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart, holding an EZ bar with an underhand grip.",
      "Allow your arms to fully extend and let the barbell hang in front of you.",
      "Curl the barbell towards your shoulders while keeping your upper arms stationary.",
      "Squeeze your biceps at the top of the movement, then lower the barbell back down.",
      "Perform the curling motion for desired reps.",
      "Exhale as you curl the barbell, inhale as you lower it.",
      "Maintain a stable stance and avoid swinging the bar."
    ]
  },
  {
    "name": "Bicep Curl",
    "category": "Biceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "bicepcurldb.png",
    "image_detail": "bicepcurldb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart, holding a dumbbell in each hand with palms facing forward.",
      "Allow your arms to fully extend and let the dumbbells hang by your sides.",
      "Curl the dumbbells towards your shoulders while keeping your upper arms stationary.",
      "Squeeze your biceps at the top of the movement, then lower the dumbbells back down.",
      "Perform the curling motion for desired reps.",
      "Exhale as you curl the dumbbells, inhale as you lower them.",
      "Avoid using your back to swing the dumbbells up."
    ]
  },
  {
    "name": "Bicep Curl",
    "category": "Biceps",
    "equipment": "Barbell",
    "type": "weight",
    "image": "bicepcurlbb.png",
    "image_detail": "bicepcurlbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart, holding a barbell with an underhand grip.",
      "Allow your arms to fully extend and let the barbell hang in front of you.",
      "Curl the barbell towards your shoulders while keeping your upper arms stationary.",
      "Squeeze your biceps at the top of the movement, then lower the barbell back down.",
      "Perform the curling motion for desired reps.",
      "Exhale as you curl the barbell, inhale as you lower it.",
      "Maintain proper posture and avoid using momentum."
    ]
  },
  {
    "name": "Bicep Curl",
    "category": "Biceps",
    "equipment": "Cable",
    "type": "weight",
    "image": "bicepcurlcable.png",
    "image_detail": "bicepcurlcable-detail.jpg",
    "description": [
      "Attach a straight bar to a cable pulley at the lowest setting.",
      "Stand facing the cable machine with your feet shoulder-width apart.",
      "Grasp the bar with an underhand grip and fully extend your arms.",
      "Curl the bar towards your shoulders while keeping your upper arms stationary.",
      "Squeeze your biceps at the top of the movement, then lower the bar back down.",
      "Perform the curling motion for desired reps.",
      "Exhale as you curl the bar, inhale as you extend your arms.",
      "Maintain a stable stance and controlled movements."
    ]
  },
  {
    "name": "Bicycle Crunch",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "bicyclecrunch.png",
    "image_detail": "bicyclecrunch-detail.jpg",
    "description": [
      "Lie on your back with your hands behind your head and your knees lifted.",
      "Bring your right elbow towards your left knee while simultaneously extending your right leg straight out.",
      "Rotate your torso to bring your left elbow towards your right knee as you switch leg positions.",
      "Continue alternating sides in a pedaling motion.",
      "Perform the motion for desired reps or time.",
      "Exhale as you twist and bring your elbow towards your knee.",
      "Keep your lower back on the ground and engage your core throughout."
    ]
  },
  {
    "name": "Box Jump",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "boxjump.png",
    "image_detail": "boxjump-detail.jpg",
    "description": [
      "Stand in front of a sturdy box or platform with your feet hip-width apart.",
      "Bend at your hips and knees to lower into a quarter squat position.",
      "Explosively jump onto the box, driving your arms upward for momentum.",
      "Land softly on the box with both feet, ensuring your knees are aligned with your toes.",
      "Stand up fully on the box and then step or jump back down to the starting position.",
      "Perform the jump for desired reps.",
      "Engage your core, use your arms for balance, and maintain proper landing mechanics."
    ]
  },
  {
    "name": "Box Squat",
    "category": "Legs",
    "equipment": "Barbell",
    "type": "weight",
    "image": "boxsquat.png",
    "image_detail": "boxsquat-detail.jpg",
    "description": [
      "Set up a box or bench behind you.",
      "Position the barbell on your upper traps and shoulders (back squat position).",
      "Stand in front of the box with your feet shoulder-width apart.",
      "Hinge at your hips and sit back onto the box, keeping your chest up and your back flat.",
      "Pause briefly on the box before driving through your heels to stand back up.",
      "Perform the squatting motion for desired reps.",
      "Exhale as you stand up, inhale as you sit back down.",
      "Engage your core, keep your knees in line with your feet, and maintain a neutral spine."
    ]
  },
  {
    "name": "Bulgarian Split Squat",
    "category": "Legs",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "bulgariansplitsquat.png",
    "image_detail": "bulgariansplitsquat-detail.jpg",
    "description": [
      "Stand a few feet away from a bench or elevated surface.",
      "Hold a dumbbell in each hand, letting them hang at your sides.",
      "Place one foot behind you on the bench while keeping the other foot planted on the ground.",
      "Lower your back knee towards the ground, creating a lunge position.",
      "Push through the front heel to return to the starting position.",
      "Perform the lunge motion for desired reps on one leg before switching.",
      "Exhale as you push up, inhale as you lower down.",
      "Keep your core engaged, maintain balance, and avoid leaning forward."
    ]
  },
  {
    "name": "Burpee",
    "category": "Full Body",
    "equipment": "",
    "type": "bodyweight",
    "image": "burpee.png",
    "image_detail": "burpee-detail.jpg",
    "description": [
      "Start in a standing position with your feet shoulder-width apart.",
      "Lower into a squat position and place your hands on the floor in front of you.",
      "Kick your feet back into a plank position, perform a push-up if desired.",
      "Quickly jump your feet back to the squat position.",
      "Explosively jump up into the air, reaching your arms overhead.",
      "Land softly and immediately go into the next repetition.",
      "Perform the sequence for desired reps or time.",
      "Engage your core, maintain a strong plank, and use your legs for power."
    ]
  },
  {
    "name": "Cable Crossover",
    "category": "Chest",
    "equipment": "Cable",
    "type": "weight",
    "image": "cablecrossover.png",
    "image_detail": "cablecrossover-detail.jpg",
    "description": [
      "Set the cables at chest height on a cable crossover machine.",
      "Stand in the center of the machine and hold a handle in each hand.",
      "Step forward with one foot and lean slightly forward.",
      "With a slight bend in your elbows, bring your hands together in front of you.",
      "Squeeze your chest at the peak of the movement.",
      "Slowly release and return your arms to the starting position.",
      "Exhale as you contract your chest, inhale as you return to the starting position.",
      "Keep your core engaged, maintain a slight bend in your elbows, and avoid using momentum."
    ]
  },
  {
    "name": "Cable Crunch",
    "category": "Core",
    "equipment": "Cable",
    "type": "weight",
    "image": "cablecrunch.png",
    "image_detail": "cablecrunch-detail.jpg",
    "description": [
      "Attach a rope handle to the high pulley of a cable machine.",
      "Kneel in front of the machine and hold the rope behind your head with your elbows bent.",
      "Flex your waist, crunching your torso down towards the ground.",
      "Keep your lower body stationary; use your abs to pull the weight.",
      "Pause briefly and contract your abs at the bottom of the movement.",
      "Slowly allow the weight to pull your torso back up to the starting position.",
      "Exhale as you crunch down, inhale as you return to the starting position.",
      "Maintain control, focus on using your abs, and avoid pulling with your arms."
    ]
  },
  {
    "name": "Cable Kickback",
    "category": "Triceps",
    "equipment": "Cable",
    "type": "weight",
    "image": "cablekickback.png",
    "image_detail": "cablekickback-detail.jpg",
    "description": [
      "Attach a single-handle attachment to the low pulley of a cable machine.",
      "Stand facing the machine and hold the handle in one hand, palm facing up.",
      "Bend your knees slightly and hinge forward at your hips, keeping your back flat.",
      "Keep your upper arm close to your torso and your elbow bent.",
      "Fully extend your arm behind you by contracting your triceps.",
      "Pause briefly at the top of the movement and squeeze your triceps.",
      "Slowly lower the handle back to the starting position with control.",
      "Exhale as you extend your arm, inhale as you return to the starting position.",
      "Focus on using your triceps to move the weight and avoid swinging."
    ]
  },
  {
    "name": "Cable Pull Through",
    "category": "Legs",
    "equipment": "Cable",
    "type": "weight",
    "image": "cablepullthrough.png",
    "image_detail": "cablepullthrough-detail.jpg",
    "description": [
      "Set the cable machine to the lowest pulley position and attach a rope handle.",
      "Stand facing away from the machine with your feet shoulder-width apart.",
      "Hold the rope between your legs and take a few steps forward to create tension.",
      "Hinge at your hips and push your glutes back while keeping your back straight.",
      "Allow the cable to pull your hands and the rope through your legs.",
      "Keep your knees slightly bent and your core engaged throughout the movement.",
      "Stand back up by driving your hips forward, pulling the rope back to the starting position.",
      "Exhale as you stand up, inhale as you hinge forward.",
      "Focus on using your hips and glutes to move the weight, maintain a neutral spine."
    ]
  },
  {
    "name": "Cable Twist",
    "category": "Core",
    "equipment": "Cable",
    "type": "weight",
    "image": "cabletwist.png",
    "image_detail": "cabletwist-detail.jpg",
    "description": [
      "Attach a D-handle to the high pulley of a cable machine.",
      "Stand sideways to the machine and hold the handle with both hands, arms extended.",
      "Position your feet shoulder-width apart and slightly bend your knees.",
      "Keep your hips and feet stationary as you twist your torso away from the machine.",
      "Rotate your torso and pull the handle across your body until your hands are at the opposite side of your body.",
      "Pause briefly at the peak of the movement and engage your obliques.",
      "Slowly return the handle to the starting position with control.",
      "Exhale as you twist, inhale as you return to the starting position.",
      "Focus on using your obliques to rotate and avoid using momentum."
    ]
  },
  {
    "name": "Calf Press on Leg Press",
    "category": "Calves",
    "equipment": "Machine",
    "type": "weight",
    "image": "calfpressonlegpress.png",
    "image_detail": "calfpressonlegpress-detail.jpg",
    "description": [
      "Sit down on a leg press machine and place your feet shoulder-width apart on the platform.",
      "Release the safety handles and fully extend your legs without locking your knees.",
      "Place the balls of your feet on the lower half of the platform, allowing your heels to hang off.",
      "Lower your heels below the level of the platform to stretch your calves.",
      "Push through the balls of your feet to raise the weight by extending your ankles.",
      "Pause briefly at the top of the movement and contract your calf muscles.",
      "Lower your heels back down to the stretched position with control.",
      "Exhale as you raise your heels, inhale as you lower them.",
      "Focus on using your calf muscles to move the weight and avoid using your knees."
    ]
  },
  {
    "name": "Calf Press on Seated Leg Press",
    "category": "Calves",
    "equipment": "Machine",
    "type": "weight",
    "image": "calfpressonseatedlegpress.png",
    "image_detail": "calfpressonseatedlegpress-detail.jpg",
    "description": [
      "Sit down on a seated leg press machine and place your feet shoulder-width apart on the platform.",
      "Release the safety handles and position your toes on the lower half of the platform.",
      "Push through the balls of your feet to raise the weight by extending your ankles.",
      "Pause briefly at the top of the movement and contract your calf muscles.",
      "Lower your heels back down to the starting position with control.",
      "Exhale as you raise your heels, inhale as you lower them.",
      "Focus on using your calf muscles to move the weight and avoid using your knees.",
      "Keep your back pressed against the seat and maintain proper posture."
    ]
  },
  {
    "name": "Chest Dip",
    "category": "Chest",
    "equipment": "",
    "type": "weight",
    "image": "chestdip.png",
    "image_detail": "chestdip-detail.jpg",
    "description": [
      "Find parallel bars that are sturdy enough to support your weight.",
      "Hold onto the bars with your palms facing downward and your elbows slightly bent.",
      "Straighten your arms and lift your body off the ground, supporting your weight with your arms.",
      "Lower your body by bending your elbows, keeping your chest up and your shoulders down.",
      "Stop when your shoulders are slightly below your elbows.",
      "Push through your palms to raise your body back up to the starting position.",
      "Exhale as you push up, inhale as you lower down.",
      "Focus on using your chest muscles to push and avoid swinging your legs."
    ]
  },
  {
    "name": "Chest Dip (Assisted)",
    "category": "Chest",
    "equipment": "",
    "type": "weight",
    "image": "chestdipassisted.png",
    "image_detail": "chestdipassisted-detail.jpg",
    "description": [
      "Find parallel bars that are sturdy enough to support your weight.",
      "Use a resistance band to assist you by placing it over the bars and under your knees.",
      "Hold onto the bars with your palms facing downward and your elbows slightly bent.",
      "Straighten your arms and lift your body off the ground, allowing the band to assist your weight.",
      "Lower your body by bending your elbows, keeping your chest up and your shoulders down.",
      "Stop when your shoulders are slightly below your elbows.",
      "Push through your palms to raise your body back up with the assistance of the band.",
      "Exhale as you push up, inhale as you lower down.",
      "Focus on using your chest muscles to push and gradually reduce the assistance over time."
    ]
  },
  {
    "name": "Chest Fly",
    "category": "Chest",
    "equipment": "Machine",
    "type": "weight",
    "image": "chestflymachine.png",
    "image_detail": "chestflymachine-detail.jpg",
    "description": [
      "Sit down on a chest fly machine and grasp the handles with your palms facing inward.",
      "Press the handles together in front of you by squeezing your chest muscles.",
      "Keep a slight bend in your elbows throughout the movement.",
      "Open your arms and allow the machine's arms to move out to your sides.",
      "Feel the stretch in your chest muscles as your arms move apart.",
      "Bring the handles back together in front of you in a controlled manner.",
      "Exhale as you squeeze your chest, inhale as you return to the starting position.",
      "Focus on using your chest muscles to control the movement and avoid using momentum."
    ]
  },
  {
    "name": "Chest Fly",
    "category": "Chest",
    "equipment": "Band",
    "type": "weight",
    "image": "chestflyband.png",
    "image_detail": "chestflyband-detail.jpg",
    "description": [
      "Attach a resistance band to a stable anchor point at chest height.",
      "Hold one end of the band in each hand with your palms facing forward.",
      "Step forward to create tension in the band and extend your arms out to your sides.",
      "Keep a slight bend in your elbows throughout the movement.",
      "Squeeze your chest muscles as you bring your hands together in front of you.",
      "Feel the stretch in your chest muscles as you move your arms apart.",
      "Control the band as you return to the starting position with your arms extended.",
      "Exhale as you squeeze your chest, inhale as you move your arms apart.",
      "Focus on using your chest muscles to control the movement and maintain proper posture."
    ]
  },
  {
    "name": "Chest Fly",
    "category": "Chest",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "chestflydb.png",
    "image_detail": "chestflydb-detail.jpg",
    "description": [
      "Lie down on a flat bench and hold a dumbbell in each hand above your chest.",
      "Start with your arms extended and a slight bend in your elbows.",
      "Lower your arms out to your sides in a controlled manner, feeling the stretch in your chest.",
      "Keep your elbows slightly bent and maintain control of the dumbbells.",
      "Bring the dumbbells back up above your chest by squeezing your chest muscles.",
      "Exhale as you bring the dumbbells together, inhale as you lower them.",
      "Focus on using your chest muscles to control the movement and avoid arching your back."
    ]
  },
  {
    "name": "Chest Press",
    "category": "Chest",
    "equipment": "Machine",
    "type": "weight",
    "image": "chestpressmachine.png",
    "image_detail": "chestpressmachine-detail.jpg",
    "description": [
      "Sit down on a chest press machine and grasp the handles with your palms facing forward.",
      "Push the handles forward by extending your arms, engaging your chest muscles.",
      "Fully extend your arms without locking your elbows.",
      "Control the handles as you bring them back towards your chest in a controlled manner.",
      "Feel the stretch in your chest muscles as you bring the handles closer to your body.",
      "Exhale as you push the handles forward, inhale as you pull them back.",
      "Focus on using your chest muscles to control the movement and avoid using momentum.",
      "Keep your back against the seat and maintain proper posture."
    ]
  },
  {
    "name": "Chin Up",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "chinup.png",
    "image_detail": "chinup-detail.jpg",
    "description": [
      "Find a horizontal bar that is high enough to allow you to hang freely.",
      "Grasp the bar with an underhand grip (palms facing you) and your hands shoulder-width apart.",
      "Hang from the bar with your arms fully extended and your feet off the ground.",
      "Pull your body up towards the bar by bending your elbows and engaging your back muscles.",
      "Try to bring your chin over the bar or as close as possible.",
      "Lower your body back down with control until your arms are fully extended.",
      "Exhale as you pull up, inhale as you lower down.",
      "Focus on using your back muscles to initiate the movement and avoid swinging."
    ]
  },
  {
    "name": "Chin Up (Assisted)",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "chinupassisted.png",
    "image_detail": "chinupassisted-detail.jpg",
    "description": [
      "Find a horizontal bar that is high enough to allow you to hang freely.",
      "Use a resistance band looped around the bar to assist you.",
      "Grasp the bar with an underhand grip (palms facing you) and your hands shoulder-width apart.",
      "Hang from the bar with your arms fully extended and your feet off the ground.",
      "The resistance band should support some of your weight as you pull up.",
      "Pull your body up towards the bar by bending your elbows and engaging your back muscles.",
      "Lower your body back down with control until your arms are fully extended.",
      "Exhale as you pull up, inhale as you lower down.",
      "Focus on using your back muscles to initiate the movement and gradually reduce the assistance."
    ]
  },
  {
    "name": "Clean",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "cleanbb.png",
    "image_detail": "cleanbb-detail.jpg",
    "description": [
      "Stand in front of a barbell with your feet shoulder-width apart.",
      "Bend at your hips and knees to grip the barbell with an overhand grip, slightly wider than shoulder-width.",
      "Your hips should be lower than your shoulders, and your back should be flat.",
      "Drive through your heels, extend your hips and knees, and lift the barbell off the ground.",
      "As the barbell rises, explosively shrug your shoulders and pull the barbell upwards.",
      "As the bar reaches its highest point, quickly drop under it and catch it at shoulder height.",
      "Your elbows should be pointing forward as you catch the bar on the front of your shoulders.",
      "Stand up to finish the movement, and then lower the barbell back to the ground.",
      "Exhale as you lift the bar, inhale as you catch it.",
      "This is a complex movement; proper form and technique are essential."
    ]
  },
  {
    "name": "Clean and Jerk",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "cleanandjerkbb.png",
    "image_detail": "cleanandjerkbb-detail.jpg",
    "description": [
      "Stand in front of a barbell with your feet shoulder-width apart.",
      "Bend at your hips and knees to grip the barbell with an overhand grip, slightly wider than shoulder-width.",
      "Your hips should be lower than your shoulders, and your back should be flat.",
      "Drive through your heels, extend your hips and knees, and lift the barbell off the ground.",
      "As the barbell rises, explosively shrug your shoulders and pull the barbell upwards.",
      "As the bar reaches its highest point, drop under it and catch it at shoulder height.",
      "Quickly stand up and press the barbell overhead using your legs and upper body.",
      "Fully extend your arms and lock out your elbows to complete the jerk.",
      "Lower the barbell back to your shoulders and then to the ground.",
      "Exhale as you lift the bar and as you press it overhead, inhale as you catch it.",
      "This is a complex movement; proper form and technique are essential."
    ]
  },
  {
    "name": "Concentration Curl",
    "category": "Biceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "concentrationcurldb.png",
    "image_detail": "concentrationcurldb-detail.jpg",
    "description": [
      "Sit down on a bench with your legs spread apart and a dumbbell between your feet.",
      "Hold the dumbbell with one hand using an underhand grip and fully extend your arm.",
      "Rest your elbow against the inside of your thigh, just above your knee.",
      "Curl the dumbbell upward while keeping your upper arm stationary.",
      "Continue to curl until the dumbbell is at shoulder level, contracting your biceps.",
      "Pause briefly at the top of the movement and squeeze your biceps.",
      "Lower the dumbbell back down to the starting position with control.",
      "Exhale as you curl up, inhale as you lower down.",
      "Focus on using your biceps to lift the weight and avoid using momentum.",
      "Switch arms to work both biceps evenly."
    ]
  },
  {
    "name": "Cross Body Crunch",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "crossbodycrunch.png",
    "image_detail": "crossbodycrunch-detail.jpg",
    "description": [
      "Lie down on your back with your knees bent and your feet flat on the ground.",
      "Place your hands behind your head, elbows pointing out to the sides.",
      "Contract your core muscles and lift your shoulders off the ground.",
      "As you lift, twist your torso and bring your right elbow towards your left knee.",
      "Extend your right leg out diagonally while keeping it slightly off the ground.",
      "Lower your shoulders back down, but don't let them touch the ground.",
      "Repeat the movement on the other side by bringing your left elbow towards your right knee.",
      "Exhale as you lift and twist, inhale as you lower down.",
      "Focus on using your core muscles to lift and twist, avoid pulling on your neck."
    ]
  },
  {
    "name": "Crunch",
    "category": "Core",
    "equipment": "Machine",
    "type": "weight",
    "image": "crunchmachine.png",
    "image_detail": "crunchmachine-detail.jpg",
    "description": [
      "Sit down on a crunch machine and adjust the thigh pads to fit your legs.",
      "Place your hands behind your head or cross your arms over your chest.",
      "Lean back slightly and curl your upper body towards your thighs.",
      "Contract your abs and exhale as you crunch, feeling your core engage.",
      "Pause briefly at the peak of the movement and squeeze your abs.",
      "Slowly release and lower your upper body back to the starting position.",
      "Inhale as you release the crunch, exhale as you crunch up.",
      "Focus on using your core muscles to lift and control the movement."
    ]
  },
  {
    "name": "Crunch",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "crunch.png",
    "image_detail": "crunch-detail.jpg",
    "description": [
      "Lie down on your back with your knees bent and your feet flat on the ground.",
      "Place your hands behind your head, elbows pointing out to the sides.",
      "Contract your core muscles and lift your shoulders off the ground, curling your upper body.",
      "Exhale as you crunch up and engage your abs, lifting your upper back off the ground.",
      "Pause briefly at the peak of the movement and squeeze your abs.",
      "Slowly release and lower your upper body back to the starting position.",
      "Inhale as you release the crunch, exhale as you crunch up.",
      "Focus on using your core muscles to lift and avoid pulling on your neck."
    ]
  },
  {
    "name": "Crunch (Stability Ball)",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "crunchstabilityball.png",
    "image_detail": "crunchstabilityball-detail.jpg",
    "description": [
      "Sit on a stability ball and roll your body down until your lower back is supported.",
      "Place your hands behind your head or cross your arms over your chest.",
      "Contract your core muscles and lift your shoulders off the ball, curling your upper body.",
      "Exhale as you crunch up and engage your abs, lifting your upper back off the ball.",
      "Pause briefly at the peak of the movement and squeeze your abs.",
      "Slowly release and lower your upper body back to the starting position on the ball.",
      "Inhale as you release the crunch, exhale as you crunch up.",
      "Focus on using your core muscles to lift and avoid hyperextending your lower back."
    ]
  },
  {
    "name": "Cycling",
    "category": "Cardio",
    "equipment": "",
    "type": "time",
    "image": "cyclingindoor.png",
    "image_detail": "cyclingindoor-detail.jpg",
    "description": [
      "Use an indoor stationary bike or a regular bike on a stationary trainer.",
      "Adjust the seat height so that your legs are slightly bent at the bottom of the pedal stroke.",
      "Adjust the handlebars for a comfortable riding position.",
      "Start pedaling and gradually increase your intensity to your desired level.",
      "Keep your core engaged and maintain proper posture throughout the ride.",
      "You can vary the resistance and speed to simulate different terrains and intensities.",
      "Keep your breathing steady and focus on your leg movements.",
      "Continue cycling for the desired duration of your cardio workout."
    ]
  },
  {
    "name": "Deadlift",
    "category": "Back",
    "equipment": "Band",
    "type": "weight",
    "image": "deadliftband.png",
    "image_detail": "deadliftband-detail.jpg",
    "description": [
      "Step on the center of a resistance band with your feet shoulder-width apart.",
      "Hold the handles or ends of the band with an overhand grip in each hand.",
      "Bend at your hips and knees, keeping your back flat and chest up.",
      "Drive through your heels and stand up, pulling the band upwards as you lift.",
      "Stand tall with your hips fully extended and your shoulders pulled back.",
      "Lower the band back down with control, bending at your hips and knees.",
      "Exhale as you lift, inhale as you lower down.",
      "Keep tension in the band throughout the movement."
    ]
  },
  {
    "name": "Deadlift",
    "category": "Back",
    "equipment": "Barbell",
    "type": "weight",
    "image": "deadliftbb.png",
    "image_detail": "deadliftbb-detail.jpg",
    "description": [
      "Approach a barbell with your feet hip-width apart.",
      "Bend at your hips and knees to grip the barbell with an overhand grip, hands just outside your knees.",
      "Keep your back flat, chest up, and your gaze forward.",
      "Stand up by driving through your heels, lifting the bar off the ground.",
      "Extend your hips and knees fully at the top of the movement.",
      "Lower the bar back down with control, bending at your hips and knees.",
      "Exhale as you lift, inhale as you lower down.",
      "Engage your core and maintain a neutral spine throughout the lift."
    ]
  },
  {
    "name": "Deadlift",
    "category": "Back",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "deadliftdb.png",
    "image_detail": "deadliftdb-detail.jpg",
    "description": [
      "Place a pair of dumbbells in front of you and stand with your feet hip-width apart.",
      "Bend at your hips and knees to grip the dumbbells with an overhand grip.",
      "Keep your back flat, chest up, and your gaze forward.",
      "Stand up by driving through your heels, lifting the dumbbells off the ground.",
      "Extend your hips and knees fully at the top of the movement.",
      "Lower the dumbbells back down with control, bending at your hips and knees.",
      "Exhale as you lift, inhale as you lower down.",
      "Engage your core and maintain a neutral spine throughout the lift."
    ]
  },
  {
    "name": "Deadlift High Pull",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "deadlifthighpullbb.png",
    "image_detail": "deadlifthighpullbb-detail.jpg",
    "description": [
      "Stand in front of a barbell with your feet shoulder-width apart.",
      "Bend at your hips and knees to grip the barbell with an overhand grip, hands just outside your knees.",
      "Your hips should be lower than your shoulders, and your back should be flat.",
      "Drive through your heels, extend your hips and knees, and lift the barbell off the ground.",
      "As the barbell rises, explosively shrug your shoulders and pull the barbell upwards.",
      "Bend your elbows and pull the barbell towards your chin, lifting it as high as possible.",
      "Lower the barbell back down to the ground with control.",
      "Exhale as you lift the bar, inhale as you lower down.",
      "This movement combines the deadlift and a high pull motion."
    ]
  },
  {
    "name": "Decline Bench Press",
    "category": "Chest",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "declinebenchpressdb.png",
    "image_detail": "declinebenchpressdb-detail.jpg",
    "description": [
      "Lie down on a decline bench with your head lower than your hips.",
      "Hold a dumbbell in each hand with an overhand grip, palms facing away from you.",
      "Extend your arms upward, directly above your shoulders.",
      "Lower the dumbbells down to the sides of your chest, keeping your elbows at a 90-degree angle.",
      "Press the dumbbells back up to the starting position, fully extending your arms.",
      "Exhale as you press up, inhale as you lower down.",
      "Engage your core and maintain stability on the decline bench."
    ]
  },
  {
    "name": "Decline Bench Press",
    "category": "Chest",
    "equipment": "Barbell",
    "type": "weight",
    "image": "declinebenchpressbb.png",
    "image_detail": "declinebenchpressbb-detail.jpg",
    "description": [
      "Lie down on a decline bench with your head lower than your hips.",
      "Grip the barbell with an overhand grip slightly wider than shoulder-width.",
      "Unrack the barbell and hold it directly above your chest with your arms fully extended.",
      "Lower the barbell down to your chest, keeping your elbows at a 90-degree angle.",
      "Press the barbell back up to the starting position, fully extending your arms.",
      "Exhale as you press up, inhale as you lower down.",
      "Engage your core and maintain stability on the decline bench."
    ]
  },
  {
    "name": "Decline Bench Press",
    "category": "Chest",
    "equipment": "Smith Machine",
    "type": "weight",
    "image": "declinebenchpresssmithmachine.png",
    "image_detail": "declinebenchpresssmithmachine-detail.jpg",
    "description": [
      "Set up a decline bench inside a Smith machine.",
      "Lie down on the bench with your head lower than your hips.",
      "Grip the bar with an overhand grip, slightly wider than shoulder-width.",
      "Unrack the barbell and hold it directly above your chest with your arms fully extended.",
      "Lower the barbell down to your chest, keeping your elbows at a 90-degree angle.",
      "Press the barbell back up to the starting position, fully extending your arms.",
      "Exhale as you press up, inhale as you lower down.",
      "Engage your core and maintain stability on the decline bench."
    ]
  },
  {
    "name": "Decline Crunch",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "declinecrunch.png",
    "image_detail": "declinecrunch-detail.jpg",
    "description": [
      "Lie down on a decline bench with your head lower than your hips.",
      "Place your hands behind your head, elbows pointing out to the sides.",
      "Engage your core and lift your upper body toward your knees, curling your torso.",
      "Exhale as you crunch up, focusing on contracting your abdominal muscles.",
      "Lower your upper body back down with control, keeping tension on your abs.",
      "Inhale as you lower down, exhale as you crunch up.",
      "Avoid pulling on your neck with your hands; use your abs to lift."
    ]
  },
  {
    "name": "Deficit Deadlift",
    "category": "Legs",
    "equipment": "Barbell",
    "type": "weight",
    "image": "deficitdeadliftbb.png",
    "image_detail": "deficitdeadliftbb-detail.jpg",
    "description": [
      "Stand on a platform or weight plates with your feet hip-width apart.",
      "Bend at your hips and knees to grip the barbell with an overhand grip.",
      "Your hips should be lower than your shoulders, and your back should be flat.",
      "Drive through your heels, extend your hips and knees, and lift the barbell off the ground.",
      "Extend your hips and knees fully at the top of the movement.",
      "Lower the barbell back down with control, bending at your hips and knees.",
      "Exhale as you lift, inhale as you lower down.",
      "Engage your core and maintain a neutral spine throughout the lift."
    ]
  },
  {
    "name": "Elliptical Machine",
    "category": "Cardio",
    "equipment": "",
    "type": "time",
    "image": "ellipcticalmachine.png",
    "image_detail": "ellipcticalmachine-detail.jpg",
    "description": [
      "Step onto the pedals of the elliptical machine.",
      "Hold onto the handles and maintain an upright posture.",
      "Start pedaling in a fluid motion, alternating between pushing and pulling with your legs.",
      "Adjust the resistance level as desired to increase or decrease the intensity.",
      "Keep a consistent pace and engage your core for stability.",
      "Continue for the desired duration of your cardio session."
    ]
  },
  {
    "name": "Face Pull",
    "category": "Back",
    "equipment": "Cable",
    "type": "weight",
    "image": "facepullcable.png",
    "image_detail": "facepullcable-detail.jpg",
    "description": [
      "Attach a rope attachment to a cable machine at chest height.",
      "Stand facing the cable machine with your feet shoulder-width apart.",
      "Hold onto the rope ends with an overhand grip, palms facing each other.",
      "Step back a few steps to create tension on the cable.",
      "Keep your upper arms parallel to the ground and your elbows pointing out.",
      "Pull the rope towards your face by retracting your shoulder blades and squeezing your upper back.",
      "Keep your hands close to your face and your elbows high.",
      "Slowly release the tension and extend your arms back to the starting position.",
      "Exhale as you pull the rope, inhale as you release.",
      "This exercise targets the rear deltoids and upper back muscles."
    ]
  },
  {
    "name": "Flat Knee Raise",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "flatkneeraise.png",
    "image_detail": "flatkneeraise-detail.jpg",
    "description": [
      "Lie down on your back on a flat surface.",
      "Place your hands under your hips or extend them alongside your body.",
      "Keep your legs straight and lift them upward, perpendicular to the ground.",
      "Engage your core and use your lower abdominal muscles to raise your legs.",
      "Lower your legs back down with control, but don't let them touch the ground.",
      "Exhale as you lift your legs, inhale as you lower them.",
      "Avoid arching your back; keep it in contact with the ground."
    ]
  },
  {
    "name": "Flat Leg Raise",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "flatlegraise.png",
    "image_detail": "flatlegraise-detail.jpg",
    "description": [
      "Lie down on your back on a flat surface.",
      "Place your hands under your hips or extend them alongside your body.",
      "Keep your legs straight and lift them upward, perpendicular to the ground.",
      "Engage your core and use your lower abdominal muscles to raise your legs.",
      "Lower your legs back down with control, but don't let them touch the ground.",
      "Exhale as you lift your legs, inhale as you lower them.",
      "Avoid arching your back; keep it in contact with the ground."
    ]
  },
  {
    "name": "Front Raise",
    "category": "Shoulders",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "frontraisedb.png",
    "image_detail": "frontraisedb-detail.jpg",
    "description": [
      "Stand with a dumbbell in each hand, arms fully extended by your sides.",
      "Keep a slight bend in your elbows and your palms facing your body.",
      "Engage your core and maintain a neutral spine.",
      "Raise the dumbbells directly in front of you until they reach shoulder height.",
      "Keep your arms extended but not locked, and your wrists in a neutral position.",
      "Lower the dumbbells back down with control to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets the front deltoids."
    ]
  },
  {
    "name": "Front Raise",
    "category": "Shoulders",
    "equipment": "Barbell",
    "type": "weight",
    "image": "frontraisebb.png",
    "image_detail": "frontraisebb-detail.jpg",
    "description": [
      "Stand with a barbell in front of you, hands shoulder-width apart, palms facing down.",
      "Grip the barbell with a pronated (overhand) grip.",
      "Engage your core and maintain a neutral spine.",
      "Raise the barbell directly in front of you until it reaches shoulder height.",
      "Keep your arms extended but not locked, and your wrists in a neutral position.",
      "Lower the barbell back down with control to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets the front deltoids."
    ]
  },
  {
    "name": "Front Raise",
    "category": "Shoulders",
    "equipment": "Band",
    "type": "weight",
    "image": "frontraiseband.png",
    "image_detail": "frontraiseband-detail.jpg",
    "description": [
      "Attach a resistance band to a stationary object at hip height.",
      "Stand facing the band with your feet shoulder-width apart.",
      "Hold onto the band with both hands, arms fully extended by your sides.",
      "Keep a slight bend in your elbows and your palms facing your body.",
      "Engage your core and maintain a neutral spine.",
      "Raise your hands directly in front of you until they reach shoulder height.",
      "Keep your arms extended but not locked, and your wrists in a neutral position.",
      "Lower your hands back down with control to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets the front deltoids."
    ]
  },
  {
    "name": "Front Raise",
    "category": "Shoulders",
    "equipment": "Cable",
    "type": "weight",
    "image": "frontraisecable.png",
    "image_detail": "frontraisecable-detail.jpg",
    "description": [
      "Attach a rope attachment to a cable machine at the lowest setting.",
      "Stand facing away from the machine with your feet shoulder-width apart.",
      "Hold onto the rope ends with an overhand grip, palms facing down.",
      "Keep a slight bend in your elbows and your hands in front of your thighs.",
      "Engage your core and maintain a neutral spine.",
      "Raise your hands directly in front of you until they reach shoulder height.",
      "Keep your arms extended but not locked, and your wrists in a neutral position.",
      "Lower your hands back down with control to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets the front deltoids."
    ]
  },
  {
    "name": "Front Raise",
    "category": "Shoulders",
    "equipment": "Plate",
    "type": "weight",
    "image": "frontraiseplate.png",
    "image_detail": "frontraiseplate-detail.jpg",
    "description": [
      "Hold a weight plate with both hands, gripping it at the sides.",
      "Stand with your feet shoulder-width apart, knees slightly bent.",
      "Engage your core and maintain a neutral spine.",
      "Raise the weight plate directly in front of you until it reaches shoulder height.",
      "Keep your arms extended but not locked, and your wrists in a neutral position.",
      "Lower the weight plate back down with control to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets the front deltoids."
    ]
  },
  {
    "name": "Front Squat",
    "category": "Legs",
    "equipment": "Barbell",
    "type": "weight",
    "image": "frontsquatbb.png",
    "image_detail": "frontsquatbb-detail.jpg",
    "description": [
      "Start by standing with your feet shoulder-width apart and the barbell racked across your shoulders.",
      "Cross your arms and hold the barbell with your hands on the opposite shoulders.",
      "Keep your elbows high and your chest up as you descend into a squat.",
      "Push your hips back and bend your knees to lower your body down.",
      "Lower yourself until your thighs are at least parallel to the ground or lower.",
      "Push through your heels to stand back up, extending your hips and knees.",
      "Exhale as you rise, inhale as you squat down.",
      "Keep your core engaged and your back straight throughout the movement.",
      "This exercise primarily targets your quadriceps and glutes."
    ]
  },
  {
    "name": "Goblet Squat",
    "category": "Legs",
    "equipment": "Kettlebell",
    "type": "weight",
    "image": "gobletsquatkettlebell.png",
    "image_detail": "gobletsquatkettlebell-detail.jpg",
    "description": [
      "Hold a kettlebell close to your chest with both hands, gripping the sides of the handle.",
      "Stand with your feet shoulder-width apart.",
      "Keep your chest up, shoulders back, and core engaged.",
      "Initiate the squat by pushing your hips back and bending your knees.",
      "Lower your body into a squat position, keeping your weight on your heels.",
      "Go as low as your flexibility allows, ideally until your thighs are parallel to the ground.",
      "Push through your heels to return to the starting position.",
      "Exhale as you rise, inhale as you squat down.",
      "This exercise targets your quads, hamstrings, and glutes."
    ]
  },
  {
    "name": "Good Morning",
    "category": "Back",
    "equipment": "Barbell",
    "type": "weight",
    "image": "goodmorningbb.png",
    "image_detail": "goodmorningbb-detail.jpg",
    "description": [
      "Start by placing a barbell on your upper back, similar to a back squat position.",
      "Stand with your feet shoulder-width apart and a slight bend in your knees.",
      "Keeping your back flat and core engaged, hinge at your hips and bend forward.",
      "Lower your upper body towards the ground while maintaining a neutral spine.",
      "Go as far down as your flexibility allows or until you feel a stretch in your hamstrings.",
      "Reverse the movement by engaging your hamstrings and glutes to stand back up.",
      "Exhale as you stand up, inhale as you bend forward.",
      "This exercise primarily targets your hamstrings and lower back."
    ]
  },
  {
    "name": "Hack Squat",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "hacksquat.png",
    "image_detail": "hacksquat-detail.jpg",
    "description": [
      "Adjust the machine to your height and load the desired weight.",
      "Position yourself in the machine with your shoulders against the pads and your feet shoulder-width apart.",
      "Release the safety handles and unlock the weight.",
      "Bend your knees to lower your body into a squat position.",
      "Lower yourself as far as your flexibility allows, ideally until your thighs are parallel to the ground.",
      "Push through your heels to extend your legs and return to the starting position.",
      "Exhale as you rise, inhale as you squat down.",
      "This exercise targets your quads, hamstrings, and glutes."
    ]
  },
  {
    "name": "Hammer Curl",
    "category": "Biceps",
    "equipment": "Band",
    "type": "weight",
    "image": "hammercurlband.png",
    "image_detail": "hammercurlband-detail.jpg",
    "description": [
      "Step on the middle of a resistance band with both feet.",
      "Hold the handles of the band with your palms facing each other.",
      "Keep your arms fully extended by your sides.",
      "Curl the handles towards your shoulders while keeping your elbows close to your body.",
      "Squeeze your biceps at the top of the movement.",
      "Lower the handles back down with control to the starting position.",
      "Exhale as you curl up, inhale as you lower.",
      "This exercise targets your biceps."
    ]
  },
  {
    "name": "Hammer Curl",
    "category": "Biceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "hammercurldb.png",
    "image_detail": "hammercurldb-detail.jpg",
    "description": [
      "Stand with a dumbbell in each hand, arms fully extended by your sides.",
      "Keep your palms facing your body, in a neutral grip.",
      "Curl the dumbbells towards your shoulders while keeping your elbows close to your body.",
      "Squeeze your biceps at the top of the movement.",
      "Lower the dumbbells back down with control to the starting position.",
      "Exhale as you curl up, inhale as you lower.",
      "This exercise targets your biceps."
    ]
  },
  {
    "name": "Hammer Curl",
    "category": "Biceps",
    "equipment": "Cable",
    "type": "weight",
    "image": "hammercurlcable.png",
    "image_detail": "hammercurlcable-detail.jpg",
    "description": [
      "Attach a rope attachment to a cable machine at the lowest setting.",
      "Stand facing the machine with your feet shoulder-width apart.",
      "Hold onto the rope ends with your palms facing each other.",
      "Keep your arms fully extended by your sides.",
      "Curl the rope ends towards your shoulders while keeping your elbows close to your body.",
      "Squeeze your biceps at the top of the movement.",
      "Lower the rope ends back down with control to the starting position.",
      "Exhale as you curl up, inhale as you lower.",
      "This exercise targets your biceps."
    ]
  },
  {
    "name": "Handstand Push Up",
    "category": "Shoulders",
    "equipment": "",
    "type": "weight",
    "image": "handstandpushup.png",
    "image_detail": "handstandpushup-detail.jpg",
    "description": [
      "Assume a handstand position against a wall or with a spotter for support.",
      "Place your hands on the ground slightly wider than shoulder-width apart.",
      "Engage your core and lower yourself by bending your elbows.",
      "Lower your head towards the ground, allowing your shoulders to flex.",
      "Push through your palms to extend your arms and raise yourself back up.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise targets your shoulders."
    ]
  },
  {
    "name": "Hang Snatch",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "hangsnatchbb.png",
    "image_detail": "hangsnatchbb-detail.jpg",
    "description": [
      "Start by holding a barbell with an overhand grip slightly wider than shoulder-width apart.",
      "Bend your knees and hinge at your hips to lower the barbell to knee level.",
      "Explosively extend your hips and knees to lift the barbell upwards.",
      "As the barbell rises, pull it close to your body and rotate your elbows around the bar.",
      "Drop under the barbell and catch it overhead with locked arms.",
      "Stand up and stabilize the barbell overhead.",
      "Reverse the movement to lower the barbell back down to knee level.",
      "Exhale as you lift the barbell, inhale as you lower.",
      "This exercise works your explosiveness, hips, and shoulders."
    ]
  },
  {
    "name": "Hanging Knee Raise",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "hangingkneeraise.png",
    "image_detail": "hangingkneeraise-detail.jpg",
    "description": [
      "Hang from a pull-up bar with an overhand grip, arms fully extended.",
      "Engage your core and lift your knees towards your chest.",
      "Focus on using your abdominal muscles to initiate the movement.",
      "Lower your legs back down with control, but do not let them swing.",
      "Exhale as you lift your knees, inhale as you lower.",
      "This exercise targets your lower abs and hip flexors."
    ]
  },
  {
    "name": "Hanging Leg Raise",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "hanginglegraise.png",
    "image_detail": "hanginglegraise-detail.jpg",
    "description": [
      "Hang from a pull-up bar with an overhand grip, arms fully extended.",
      "Keep your legs fully extended and together.",
      "Engage your core and lift your legs towards the ceiling.",
      "Use your abdominal muscles to control the movement.",
      "Lower your legs back down with control, but do not let them swing.",
      "Exhale as you lift your legs, inhale as you lower.",
      "This exercise targets your lower abs and hip flexors."
    ]
  },
  {
    "name": "High Knee Skips",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "highkneeskips.png",
    "image_detail": "highkneeskips-detail.jpg",
    "description": [
      "Start by standing with your feet hip-width apart.",
      "Begin skipping while lifting your knees towards your chest.",
      "Alternate between lifting your left and right knees as high as possible.",
      "Use your arms to assist in the skipping motion.",
      "Focus on explosively driving your knees upward.",
      "This exercise is a high-intensity cardio workout."
    ]
  },
  {
    "name": "Hip Abductor",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "hipabductormachine.png",
    "image_detail": "hipabductormachine-detail.jpg",
    "description": [
      "Adjust the machine to your height and load the desired weight.",
      "Sit on the machine and position your outer thighs against the pads.",
      "Press against the pads to move your legs apart against resistance.",
      "Pause at the end of the movement, then return your legs to the starting position.",
      "Exhale as you press out, inhale as you return.",
      "This exercise targets your outer hip muscles."
    ]
  },
  {
    "name": "Hip Adductor",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "hipadductormachine.png",
    "image_detail": "hipadductormachine-detail.jpg",
    "description": [
      "Adjust the machine to your height and load the desired weight.",
      "Sit on the machine and position your inner thighs against the pads.",
      "Press against the pads to move your legs together against resistance.",
      "Pause at the end of the movement, then return your legs to the starting position.",
      "Exhale as you press in, inhale as you return.",
      "This exercise targets your inner thigh muscles."
    ]
  },
  {
    "name": "Hip Thrust",
    "category": "Glutes",
    "equipment": "Barbell",
    "type": "weight",
    "image": "hipthrustbb.png",
    "image_detail": "hipthrustbb-detail.jpg",
    "description": [
      "Sit on the ground with your upper back against a bench and a barbell across your hips.",
      "Roll the barbell over your legs until it's directly above your hips.",
      "Position your feet flat on the ground, knees bent, and feet hip-width apart.",
      "Drive through your heels and lift your hips towards the ceiling.",
      "Squeeze your glutes at the top of the movement.",
      "Lower your hips back down with control, stopping right before touching the ground.",
      "Exhale as you lift your hips, inhale as you lower.",
      "This exercise targets your glutes and hamstrings."
    ]
  },
  {
    "name": "Hip Thrust",
    "category": "Glutes",
    "equipment": "",
    "type": "weight",
    "image": "hipthrust.png",
    "image_detail": "hipthrust-detail.jpg",
    "description": [
      "Sit on the ground with your upper back against a bench or step, knees bent, and feet flat on the floor.",
      "Place a weight plate or barbell across your hips.",
      "Drive through your heels and lift your hips towards the ceiling.",
      "Squeeze your glutes at the top of the movement.",
      "Lower your hips back down with control, stopping right before touching the ground.",
      "Exhale as you lift your hips, inhale as you lower.",
      "This exercise targets your glutes and hamstrings."
    ]
  },
  {
    "name": "Incline Bench Press",
    "category": "Chest",
    "equipment": "Cable",
    "type": "weight",
    "image": "inclinebenchpress.png",
    "image_detail": "inclinebenchpress-detail.jpg",
    "description": [
      "Adjust the bench to an incline angle (usually around 30-45 degrees).",
      "Lie on the incline bench with your feet flat on the floor.",
      "Grasp the barbell with a grip slightly wider than shoulder-width.",
      "Unrack the barbell and lower it towards your upper chest while keeping your elbows slightly flared.",
      "Push the barbell back up to the starting position, fully extending your arms.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise targets your upper chest, shoulders, and triceps."
    ]
  },
  {
    "name": "Incline Bench Press",
    "category": "Chest",
    "equipment": "Barbell",
    "type": "weight",
    "image": "inclinebenchpressbb.png",
    "image_detail": "inclinebenchpressbb-detail.jpg",
    "description": [
      "Adjust the bench to an incline angle (usually around 30-45 degrees).",
      "Lie on the incline bench with your feet flat on the floor.",
      "Grasp the barbell with a grip slightly wider than shoulder-width.",
      "Unrack the barbell and lower it towards your upper chest while keeping your elbows slightly flared.",
      "Push the barbell back up to the starting position, fully extending your arms.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise targets your upper chest, shoulders, and triceps."
    ]
  },
  {
    "name": "Incline Bench Press",
    "category": "Chest",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "inclinebenchpressdb.png",
    "image_detail": "inclinebenchpressdb-detail.jpg",
    "description": [
      "Adjust the bench to an incline angle (usually around 30-45 degrees).",
      "Sit on the bench with a dumbbell in each hand, palms facing forward.",
      "Lift the dumbbells to shoulder height as you lie back on the bench.",
      "Lower the dumbbells towards your upper chest, keeping your elbows slightly flared.",
      "Push the dumbbells back up to the starting position, fully extending your arms.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise targets your upper chest, shoulders, and triceps."
    ]
  },
  {
    "name": "Incline Chest Fly",
    "category": "Chest",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "inclinechestfly.png",
    "image_detail": "inclinechestfly-detail.jpg",
    "description": [
      "Adjust the bench to an incline angle (usually around 30-45 degrees).",
      "Sit on the bench with a dumbbell in each hand, palms facing each other.",
      "Lift the dumbbells to shoulder height as you lie back on the bench.",
      "Bend your elbows slightly and open your arms out to the sides, feeling a stretch in your chest.",
      "Bring the dumbbells back together over your chest, squeezing your pecs.",
      "Exhale as you squeeze, inhale as you open your arms.",
      "This exercise targets your upper chest and inner chest."
    ]
  },
  {
    "name": "Incline Chest Press",
    "category": "Chest",
    "equipment": "Machine",
    "type": "weight",
    "image": "inclinechestpressmachine.png",
    "image_detail": "inclinechestpressmachine-detail.jpg",
    "description": [
      "Adjust the machine to an incline angle (usually around 30-45 degrees).",
      "Sit on the machine with your back against the pad.",
      "Grasp the handles and push them forward to extend your arms.",
      "Slowly bring the handles back towards your chest while keeping your elbows slightly flared.",
      "Push the handles away from your chest to the starting position.",
      "Exhale as you push, inhale as you return.",
      "This exercise targets your upper chest, shoulders, and triceps."
    ]
  },
  {
    "name": "Incline Chest Press",
    "category": "Chest",
    "equipment": "Smith Machine",
    "type": "weight",
    "image": "inclinebenchpresssmithmachine.png",
    "image_detail": "inclinebenchpresssmithmachine-detail.jpg",
    "description": [
      "Adjust the bench to an incline angle (usually around 30-45 degrees) and place it under a Smith Machine.",
      "Lie on the bench with your feet flat on the floor and your back against the bench.",
      "Grasp the bar with a grip slightly wider than shoulder-width.",
      "Unrack the bar and lower it towards your upper chest while keeping your elbows slightly flared.",
      "Push the bar back up to the starting position, fully extending your arms.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise targets your upper chest, shoulders, and triceps."
    ]
  },
  {
    "name": "Incline Curl",
    "category": "Biceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "inclinecurldb.png",
    "image_detail": "inclinecurldb-detail.jpg",
    "description": [
      "Adjust the bench to an incline angle (usually around 45-60 degrees).",
      "Sit on the bench with a dumbbell in each hand, palms facing forward.",
      "Let your arms hang down fully extended.",
      "Curl the dumbbells towards your shoulders while keeping your elbows close to your body.",
      "Squeeze your biceps at the top of the movement.",
      "Lower the dumbbells back down with control to the starting position.",
      "Exhale as you curl up, inhale as you lower.",
      "This exercise targets your biceps."
    ]
  },
  {
    "name": "Incline Row",
    "category": "Back",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "inclinerowdb.png",
    "image_detail": "inclinerowdb-detail.jpg",
    "description": [
      "Adjust the bench to an incline angle (usually around 30-45 degrees).",
      "Lie face down on the bench with a dumbbell in each hand, arms fully extended.",
      "Let your arms hang down towards the floor.",
      "Engage your back muscles and squeeze your shoulder blades together as you pull the dumbbells towards your hips.",
      "Lower the dumbbells back down with control to the starting position.",
      "Exhale as you pull up, inhale as you lower.",
      "This exercise targets your upper back and lats."
    ]
  },
  {
    "name": "Inverted Row",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "invertrowbw.png",
    "image_detail": "invertrowbw-detail.jpg",
    "description": [
      "Set up a barbell on a rack at waist height.",
      "Lie on your back under the barbell, gripping it with an overhand grip.",
      "Position your body in a straight line from head to heels.",
      "Keep your core engaged and your body rigid as you pull your chest towards the bar.",
      "Lower yourself back down with control to the starting position.",
      "Exhale as you pull up, inhale as you lower.",
      "This exercise targets your back and biceps."
    ]
  },
  {
    "name": "Iso-Lateral Chest Press",
    "category": "Chest",
    "equipment": "Machine",
    "type": "weight",
    "image": "isolateralchestpress.png",
    "image_detail": "isolateralchestpress-detail.jpg",
    "description": [
      "Adjust the machine seat and handles to your comfort.",
      "Sit on the machine and grasp the handles with a neutral grip.",
      "Push the handles forward to extend your arms.",
      "Slowly bring the handles back towards your chest, keeping your elbows slightly flared.",
      "Push the handles away from your chest to the starting position.",
      "Exhale as you push, inhale as you return.",
      "This exercise targets your chest, shoulders, and triceps."
    ]
  },
  {
    "name": "Iso-Lateral Row",
    "category": "Back",
    "equipment": "Machine",
    "type": "weight",
    "image": "isolateralrowmachine.png",
    "image_detail": "isolateralrowmachine-detail.jpg",
    "description": [
      "Adjust the machine seat and handles to your comfort.",
      "Sit on the machine and grasp the handles with a neutral grip.",
      "Pull the handles towards your hips, squeezing your shoulder blades together.",
      "Lower the handles back down with control to the starting position.",
      "Exhale as you pull, inhale as you release.",
      "This exercise targets your back and biceps."
    ]
  },
  {
    "name": "Jackknife Sit Up",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "jackknifesitup.png",
    "image_detail": "jackknifesitup-detail.jpg",
    "description": [
      "Lie on your back on a mat with your legs straight and arms extended overhead.",
      "Simultaneously lift your upper body and legs as you bring them together, reaching your hands toward your feet.",
      "Contract your abdominal muscles at the top of the movement.",
      "Lower your body back down to the starting position with control.",
      "Exhale as you lift up, inhale as you lower.",
      "This exercise targets your upper and lower abdominals."
    ]
  },
  {
    "name": "Jump Rope",
    "category": "Cardio",
    "equipment": "",
    "type": "time",
    "image": "jumprope.png",
    "image_detail": "jumprope-detail.jpg",
    "description": [
      "Hold the jump rope handles at your sides with your wrists facing forward.",
      "Swing the rope over your head and jump over it as it approaches your feet.",
      "Land on the balls of your feet and keep a slight bend in your knees.",
      "Use a light, controlled jump to avoid strain on your joints.",
      "Continue jumping for a set period of time.",
      "This exercise is a great cardiovascular workout."
    ]
  },
  {
    "name": "Jump Squat",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "jumpsquat.png",
    "image_detail": "jumpsquat-detail.jpg",
    "description": [
      "Start in a squat position with your feet shoulder-width apart.",
      "Lower your body into a deep squat, then explosively jump up as high as you can.",
      "While in mid-air, tuck your knees toward your chest.",
      "Land softly by bending your knees and immediately transition into the next squat.",
      "Exhale as you jump, inhale as you land.",
      "This exercise engages your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Jumping Jack",
    "category": "Full Body",
    "equipment": "",
    "type": "weight",
    "image": "jumpingjack.png",
    "image_detail": "jumpingjack-detail.jpg",
    "description": [
      "Stand with your feet together and arms by your sides.",
      "Jump up, spreading your legs wider than shoulder-width and raising your arms overhead.",
      "Land softly as you bring your feet back together and lower your arms to your sides.",
      "Continue this jumping motion rhythmically.",
      "Exhale as you jump, inhale as you land.",
      "Jumping jacks provide a full-body cardiovascular workout."
    ]
  },
  {
    "name": "Kettlebell Swing",
    "category": "Full Body",
    "equipment": "Kettlebell",
    "type": "weight",
    "image": "kettlebellswing.png",
    "image_detail": "kettlebellswing-detail.jpg",
    "description": [
      "Place a kettlebell on the floor in front of you.",
      "Stand with your feet shoulder-width apart and slightly bend your knees.",
      "Grasp the kettlebell with both hands and swing it between your legs while keeping your back straight.",
      "Thrust your hips forward and swing the kettlebell up to shoulder height, using the momentum from your hips.",
      "Let the kettlebell swing back down between your legs and repeat the motion.",
      "Exhale as you thrust your hips forward, inhale as you swing down.",
      "This exercise targets your hips, glutes, hamstrings, and core."
    ]
  },
  {
    "name": "Kettlebell Turkish Getup",
    "category": "Full Body",
    "equipment": "Kettlebell",
    "type": "weight",
    "image": "kettlebellturkishgetup.png",
    "image_detail": "kettlebellturkishgetup-detail.jpg",
    "description": [
      "Lie on your back with a kettlebell beside you.",
      "Grasp the kettlebell with one hand and press it up toward the ceiling.",
      "Bend your knee on the same side as the kettlebell and plant your foot flat on the floor.",
      "Prop yourself up on your opposite elbow, then lift your hips off the ground.",
      "Slide your leg under your body and come to a kneeling position.",
      "Stand up while keeping the kettlebell extended overhead.",
      "Reverse the movement to return to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise works your entire body, focusing on stability and strength."
    ]
  },
  {
    "name": "Knee Raise (Captain's Chair)",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "kneeraise.png",
    "image_detail": "kneeraise-detail.jpg",
    "description": [
      "Position yourself on a captain's chair station with your forearms resting on the pads and your back against the backrest.",
      "Keep your elbows at a 90-degree angle and your legs hanging straight down.",
      "Lift your knees toward your chest by contracting your abdominals.",
      "Lower your legs back down with control, stopping just short of full extension.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets your lower abdominals."
    ]
  },
  {
    "name": "Kneeling Pulldown",
    "category": "Back",
    "equipment": "Band",
    "type": "weight",
    "image": "kneelingpulldownband.png",
    "image_detail": "kneelingpulldownband-detail.jpg",
    "description": [
      "Attach a resistance band to a sturdy anchor point above you.",
      "Kneel down with your knees hip-width apart and grasp the resistance band with an overhand grip.",
      "Pull the band down towards your chest, squeezing your shoulder blades together.",
      "Control the band as you slowly release it back up.",
      "Exhale as you pull down, inhale as you release.",
      "This exercise targets your upper back and lats."
    ]
  },
  {
    "name": "Knees to Elbows",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "kneestoelbows.png",
    "image_detail": "kneestoelbows-detail.jpg",
    "description": [
      "Hang from a pull-up bar with your arms fully extended and your palms facing forward.",
      "Engage your core and lift your knees towards your elbows, crunching your abdominals.",
      "Lower your legs back down with control to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets your core muscles, specifically your lower abdominals."
    ]
  },
  {
    "name": "Lat Pulldown",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "latpulldown.png",
    "image_detail": "latpulldown-detail.jpg",
    "description": [
      "Sit down at a lat pulldown machine with your knees comfortably under the knee pads.",
      "Grasp the wide bar above your head with a wide grip, palms facing forward.",
      "Pull the bar down towards your chest, bringing your shoulder blades together.",
      "Slowly release the bar back up to the starting position.",
      "Exhale as you pull down, inhale as you release.",
      "This exercise targets your upper back and lats."
    ]
  },
  {
    "name": "Lat Pulldown",
    "category": "Machine",
    "equipment": "",
    "type": "weight",
    "image": "latpulldownmachine.png",
    "image_detail": "latpulldownmachine-detail.jpg",
    "description": [
      "Adjust the machine to fit your body and sit down.",
      "Grasp the wide bar above your head with a wide grip, palms facing forward.",
      "Pull the bar down towards your chest, bringing your shoulder blades together.",
      "Slowly release the bar back up to the starting position.",
      "Exhale as you pull down, inhale as you release.",
      "This exercise targets your upper back and lats."
    ]
  },
  {
    "name": "Lat Pulldown - Single Arm",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "latpulldownsinglearm.png",
    "image_detail": "latpulldownsinglearm-detail.jpg",
    "description": [
      "Sit down at a lat pulldown machine with your knees comfortably under the knee pads.",
      "Grasp the handle with one hand, palm facing forward.",
      "Pull the handle down towards your chest, bringing your shoulder blade back.",
      "Slowly release the handle back up to the starting position.",
      "Repeat with the other arm.",
      "Exhale as you pull down, inhale as you release.",
      "This exercise targets one side of your upper back and lats at a time."
    ]
  },
  {
    "name": "Lat Pulldown - Underhand",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "latpulldownunderhandband.png",
    "image_detail": "latpulldownunderhandband-detail.jpg",
    "description": [
      "Attach a resistance band to a sturdy anchor point above you.",
      "Hold the ends of the band with an underhand grip, palms facing you.",
      "Pull the band down towards your chest, squeezing your shoulder blades together.",
      "Control the band as you slowly release it back up.",
      "Exhale as you pull down, inhale as you release.",
      "This exercise targets your upper back and lats."
    ]
  },
  {
    "name": "Lat Pulldown - Wide Grip",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "latpulldownwidegripcable.png",
    "image_detail": "latpulldownwidegripcable-detail.jpg",
    "description": [
      "Attach a wide bar to a cable pulldown machine.",
      "Grasp the wide bar with a wide overhand grip, palms facing forward.",
      "Pull the bar down towards your upper chest, bringing your shoulder blades together.",
      "Slowly release the bar back up to the starting position.",
      "Exhale as you pull down, inhale as you release.",
      "This exercise targets your upper back and lats."
    ]
  },
  {
    "name": "Lateral Box Jump",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "lateralboxjump.png",
    "image_detail": "lateralboxjump-detail.jpg",
    "description": [
      "Place a sturdy box or platform beside you.",
      "Stand beside the box with your feet shoulder-width apart.",
      "Bend your knees and jump laterally onto the box, landing softly.",
      "Immediately jump back down to the starting position.",
      "Alternate sides with each jump.",
      "Exhale as you jump, inhale as you land.",
      "This exercise improves lower body power and coordination."
    ]
  },
  {
    "name": "Lateral Raise",
    "category": "Shoulders",
    "equipment": "Cable",
    "type": "weight",
    "image": "lateralraisecable.png",
    "image_detail": "lateralraisecable-detail.jpg",
    "description": [
      "Attach a D-handle to a cable machine set at shoulder height.",
      "Stand sideways to the machine with your far side facing the weight stack.",
      "Grasp the handle with the hand closest to the machine.",
      "Lift the handle out to the side, keeping your arm slightly bent.",
      "Lower the handle back down with control.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets your lateral deltoid."
    ]
  },
  {
    "name": "Lateral Raise",
    "category": "Shoulders",
    "equipment": "Band",
    "type": "weight",
    "image": "lateralraiseband.png",
    "image_detail": "lateralraiseband-detail.jpg",
    "description": [
      "Stand on a resistance band with your feet shoulder-width apart.",
      "Hold the band's ends with your hands at your sides.",
      "Raise your arms out to the sides, keeping them parallel to the ground.",
      "Lower your arms back down with control.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets your lateral deltoid."
    ]
  },
  {
    "name": "Lateral Raise",
    "category": "Shoulders",
    "equipment": "Machine",
    "type": "weight",
    "image": "lateralraisemachine.png",
    "image_detail": "lateralraisemachine-detail.jpg",
    "description": [
      "Sit down at a lateral raise machine.",
      "Place your arms against the pads provided and grasp the handles.",
      "Lift your arms out to the sides until they're parallel to the ground.",
      "Lower your arms back down with control.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets your lateral deltoid."
    ]
  },
  {
    "name": "Lateral Raise",
    "category": "Shoulders",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "lateralraisedb.png",
    "image_detail": "lateralraisedb-detail.jpg",
    "description": [
      "Stand with a dumbbell in each hand at your sides.",
      "Raise your arms out to the sides, keeping them parallel to the ground.",
      "Lower your arms back down with control.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets your lateral deltoid."
    ]
  },
  {
    "name": "Leg Curl",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "legcurlmachine.png",
    "image_detail": "legcurlmachine-detail.jpg",
    "description": [
      "Adjust the machine to fit your body and lie face down.",
      "Position your legs under the padded lever with your knees just off the edge.",
      "Curl your legs up towards your glutes, squeezing your hamstrings.",
      "Slowly extend your legs back down with control.",
      "Exhale as you curl up, inhale as you extend.",
      "This exercise targets your hamstrings."
    ]
  },
  {
    "name": "Leg Extension",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "legextensionmachine.png",
    "image_detail": "legextensionmachine-detail.jpg",
    "description": [
      "Adjust the machine to fit your body and sit down.",
      "Place your lower legs under the padded lever, just above your ankles.",
      "Extend your legs out in front of you, lifting the lever.",
      "Slowly bend your legs back down with control.",
      "Exhale as you extend, inhale as you bend.",
      "This exercise targets your quadriceps."
    ]
  },
  {
    "name": "Leg Press",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "legpress.png",
    "image_detail": "legpress-detail.jpg",
    "description": [
      "Sit down at a leg press machine and place your feet shoulder-width apart on the platform.",
      "Push the platform away from you by extending your legs, but don't lock your knees.",
      "Lower the platform back down with control.",
      "Exhale as you push, inhale as you lower.",
      "This exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Lunge",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "lungebw.png",
    "image_detail": "lungebw-detail.jpg",
    "description": [
      "Stand upright with your feet hip-width apart.",
      "Step forward with one leg and lower your body until both knees are bent at 90-degree angles.",
      "Push off the front foot to return to the starting position.",
      "Repeat on the other leg.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Lunge",
    "category": "Legs",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "lungedb.png",
    "image_detail": "lungedb-detail.jpg",
    "description": [
      "Hold a dumbbell in each hand at your sides.",
      "Step forward with one leg and lower your body until both knees are bent at 90-degree angles.",
      "Push off the front foot to return to the starting position.",
      "Repeat on the other leg.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Lunge",
    "category": "Legs",
    "equipment": "Barbell",
    "type": "weight",
    "image": "lungebb.png",
    "image_detail": "lungebb-detail.jpg",
    "description": [
      "Hold a barbell across your upper back and shoulders.",
      "Step forward with one leg and lower your body until both knees are bent at 90-degree angles.",
      "Push off the front foot to return to the starting position.",
      "Repeat on the other leg.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Lying Leg Curl",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "lyinglegcurl.png",
    "image_detail": "lyinglegcurl-detail.jpg",
    "description": [
      "Adjust the machine to fit your body and lie face down.",
      "Position your legs under the padded lever with your knees just off the edge.",
      "Curl your legs up towards your glutes, squeezing your hamstrings.",
      "Slowly extend your legs back down with control.",
      "Exhale as you curl up, inhale as you extend.",
      "This exercise targets your hamstrings."
    ]
  },
  {
    "name": "Mountain Climber",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "mountainclimber.png",
    "image_detail": "mountainclimber-detail.jpg",
    "description": [
      "Start in a high plank position with your hands directly under your shoulders.",
      "Alternate bringing your knees towards your chest, as if running in place.",
      "Keep your core engaged and maintain a straight line from head to heels.",
      "Breathe evenly as you perform the exercise.",
      "This exercise provides a cardiovascular and core workout."
    ]
  },
  {
    "name": "Muscle Up",
    "category": "Full Body",
    "equipment": "",
    "type": "weight",
    "image": "muscleup.png",
    "image_detail": "muscleup-detail.jpg",
    "description": [
      "Hang from a high bar with an overhand grip.",
      "Perform a powerful pull-up, then transition into a dip by pushing the bar down and forward.",
      "Continue the motion until your chest is above the bar and your arms are fully extended.",
      "Reverse the movement to return to the starting position.",
      "This exercise combines pulling and pushing to work various upper body muscles."
    ]
  },
  {
    "name": "Oblique Crunch",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "obliquecrunch.png",
    "image_detail": "obliquecrunch-detail.jpg",
    "description": [
      "Lie on your back with your knees bent and feet flat on the floor.",
      "Place your hands behind your head or cross your arms over your chest.",
      "Lift your upper body off the ground while twisting to one side.",
      "Engage your obliques as you perform the movement.",
      "Lower your upper body back down and repeat on the other side.",
      "Exhale as you crunch, inhale as you release.",
      "This exercise targets your oblique muscles."
    ]
  },
  {
    "name": "Overhead Press",
    "category": "Shoulders",
    "equipment": "Barbell",
    "type": "weight",
    "image": "overheadpressbb.png",
    "image_detail": "overheadpressbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart.",
      "Hold a barbell at shoulder height with an overhand grip.",
      "Press the barbell overhead until your arms are fully extended.",
      "Lower the barbell back to shoulder height with control.",
      "Exhale as you press, inhale as you lower.",
      "This exercise targets your shoulder muscles."
    ]
  },
  {
    "name": "Overhead Press",
    "category": "Shoulders",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "overheadpressdb.png",
    "image_detail": "overheadpressdb-detail.jpg",
    "description": [
      "Sit or stand with a dumbbell in each hand at shoulder height.",
      "Press the dumbbells overhead until your arms are fully extended.",
      "Lower the dumbbells back to shoulder height with control.",
      "Exhale as you press, inhale as you lower.",
      "This exercise targets your shoulder muscles."
    ]
  },
  {
    "name": "Overhead Press",
    "category": "Shoulders",
    "equipment": "Cable",
    "type": "weight",
    "image": "overheadpresscable.png",
    "image_detail": "overheadpresscable-detail.jpg",
    "description": [
      "Attach a straight bar to a high pulley cable machine.",
      "Stand facing the machine with your feet shoulder-width apart.",
      "Hold the bar with an overhand grip and your hands slightly wider than shoulder-width.",
      "Press the bar overhead until your arms are fully extended.",
      "Lower the bar back down to the starting position with control.",
      "Exhale as you press, inhale as you lower.",
      "This exercise targets your shoulder muscles."
    ]
  },
  {
    "name": "Overhead Press",
    "category": "Shoulders",
    "equipment": "Smith Machine",
    "type": "weight",
    "image": "overheadpresssmithmachine.png",
    "image_detail": "overheadpresssmithmachine-detail.jpg",
    "description": [
      "Adjust the bar of the Smith Machine to shoulder height.",
      "Stand under the bar and grasp it with an overhand grip.",
      "Press the bar overhead until your arms are fully extended.",
      "Lower the bar back down to shoulder height with control.",
      "Exhale as you press, inhale as you lower.",
      "This exercise targets your shoulder muscles."
    ]
  },
  {
    "name": "Overhead Squat",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "overheadsquatbb.png",
    "image_detail": "overheadsquatbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart and a barbell overhead.",
      "Hold the barbell wider than shoulder-width with an overhand grip.",
      "Squat down, keeping the barbell stable overhead.",
      "Keep your chest up and maintain a neutral spine.",
      "Push through your heels to return to the starting position.",
      "Exhale as you push up, inhale as you squat down.",
      "This exercise works your entire lower body and core."
    ]
  },
  {
    "name": "Pec Deck",
    "category": "Chest",
    "equipment": "Machine",
    "type": "weight",
    "image": "pecdeckmachine.png",
    "image_detail": "pecdeckmachine-detail.jpg",
    "description": [
      "Sit at the pec deck machine with your back against the pad.",
      "Place your forearms on the pads and grasp the handles.",
      "Press the handles together by squeezing your chest muscles.",
      "Slowly release the handles to return to the starting position.",
      "Exhale as you squeeze, inhale as you release.",
      "This exercise targets your pectoral muscles."
    ]
  },
  {
    "name": "Pendlay Row",
    "category": "Back",
    "equipment": "Barbell",
    "type": "weight",
    "image": "pendlayrowbb.png",
    "image_detail": "pendlayrowbb-detail.jpg",
    "description": [
      "Place a barbell on the floor in front of you.",
      "Bend at the hips and knees to grip the barbell with an overhand grip.",
      "Keep your back straight and chest up as you row the barbell towards your lower chest.",
      "Lower the barbell back to the floor with control.",
      "Exhale as you row, inhale as you release.",
      "This exercise targets your upper back muscles."
    ]
  },
  {
    "name": "Pistol Squat",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "pistolsquat.png",
    "image_detail": "pistolsquat-detail.jpg",
    "description": [
      "Stand on one leg and extend the other leg forward.",
      "Lower your body by bending your knee and hip, keeping the extended leg off the ground.",
      "Go as low as you can while maintaining balance and proper form.",
      "Push through the heel of the standing leg to return to the starting position.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise challenges your leg strength and balance."
    ]
  },
  {
    "name": "Plank",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "plank.png",
    "image_detail": "plank-detail.jpg",
    "description": [
      "Start in a push-up position with your forearms on the ground and elbows aligned under your shoulders.",
      "Engage your core, glutes, and leg muscles to maintain a straight line from head to heels.",
      "Hold the position for the desired duration.",
      "Breathe evenly throughout the exercise.",
      "This exercise strengthens your core muscles and improves stability."
    ]
  },
  {
    "name": "Power Snatch",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "powersnatchbb.png",
    "image_detail": "powersnatchbb-detail.jpg",
    "description": [
      "Stand with your feet hip-width apart and a barbell on the floor in front of you.",
      "Bend at the hips and knees to grip the barbell with a wide overhand grip.",
      "Explosively lift the barbell off the ground, extending your hips and knees.",
      "As the barbell rises, pull it close to your body and transition into an overhead squat.",
      "Press the barbell overhead as you stand up from the squat.",
      "Exhale as you lift, inhale as you squat and press.",
      "This exercise combines lifting, pulling, and squatting for a full-body workout."
    ]
  },
  {
    "name": "Preacher Curl",
    "category": "Biceps",
    "equipment": "Machine",
    "type": "weight",
    "image": "preachercurlmachine.png",
    "image_detail": "preachercurlmachine-detail.jpg",
    "description": [
      "Sit at the preacher curl machine with your upper arms resting on the pad.",
      "Grasp the handles with an underhand grip and fully extend your arms.",
      "Curl the handles towards your shoulders while keeping your upper arms stationary.",
      "Lower the handles back to the starting position with control.",
      "Exhale as you curl, inhale as you release.",
      "This exercise isolates and targets your biceps."
    ]
  },
  {
    "name": "Preacher Curl",
    "category": "Biceps",
    "equipment": "Barbell",
    "type": "weight",
    "image": "preachercurlbb.png",
    "image_detail": "preachercurlbb-detail.jpg",
    "description": [
      "Sit at a preacher curl bench with your upper arms resting on the pad and your hands on the barbell.",
      "Grasp the barbell with an underhand grip and fully extend your arms.",
      "Curl the barbell towards your shoulders while keeping your upper arms stationary.",
      "Lower the barbell back to the starting position with control.",
      "Exhale as you curl, inhale as you release.",
      "This exercise isolates and targets your biceps."
    ]
  },
  {
    "name": "Preacher Curl",
    "category": "Biceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "preachercurl.png",
    "image_detail": "preachercurl-detail.jpg",
    "description": [
      "Sit at a preacher curl bench with your upper arms resting on the pad and a dumbbell in one hand.",
      "Grasp the dumbbell with an underhand grip and fully extend your arm.",
      "Curl the dumbbell towards your shoulder while keeping your upper arm stationary.",
      "Lower the dumbbell back to the starting position with control.",
      "Exhale as you curl, inhale as you release.",
      "This exercise isolates and targets your biceps."
    ]
  },
  {
    "name": "Pull Up",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "pullup.png",
    "image_detail": "pullup-detail.jpg",
    "description": [
      "Hang from a pull-up bar with your palms facing away from you and your hands shoulder-width apart.",
      "Engage your back muscles and pull your body up until your chin is above the bar.",
      "Lower your body back down with control.",
      "Exhale as you pull up, inhale as you lower.",
      "This exercise targets your upper back and arm muscles."
    ]
  },
  {
    "name": "Pull Up",
    "category": "Back",
    "equipment": "Band",
    "type": "weight",
    "image": "pullupband.png",
    "image_detail": "pullupband-detail.jpg",
    "description": [
      "Attach a resistance band to a pull-up bar and place one knee or foot in the band.",
      "Hang from the bar with your palms facing away from you and your hands shoulder-width apart.",
      "Engage your back muscles and pull your body up until your chin is above the bar.",
      "Lower your body back down with control.",
      "Exhale as you pull up, inhale as you lower.",
      "This exercise with a resistance band assists your pull-up movement."
    ]
  },
  {
    "name": "Pull Up - Assisted",
    "category": "Back",
    "equipment": "Machine",
    "type": "weight",
    "image": "pullupassisted.png",
    "image_detail": "pullupassisted-detail.jpg",
    "description": [
      "Use an assisted pull-up machine and adjust the weight to your desired level of assistance.",
      "Hang from the pull-up bar with your palms facing away from you and your hands shoulder-width apart.",
      "Perform the pull-up motion, allowing the machine to assist your upward movement.",
      "Lower your body back down with control.",
      "Exhale as you pull up, inhale as you lower.",
      "This exercise with the assisted machine helps you build strength for unassisted pull-ups."
    ]
  },
  {
    "name": "Pull Up - Wide Grip",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "pullup.png",
    "image_detail": "pullup-detail.jpg",
    "description": [
      "Hang from a pull-up bar with your palms facing away from you and your hands wider than shoulder-width apart.",
      "Engage your back muscles and pull your body up until your chin is above the bar.",
      "Lower your body back down with control.",
      "Exhale as you pull up, inhale as you lower.",
      "This exercise targets your upper back and arm muscles, emphasizing a wide grip."
    ]
  },
  {
    "name": "Pullover",
    "category": "Chest",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "pulloverdb.png",
    "image_detail": "pulloverdb-detail.jpg",
    "description": [
      "Lie on a bench with only your upper back and shoulders on the bench, and your hips below the bench.",
      "Hold a dumbbell with both hands above your chest, arms extended.",
      "Lower the dumbbell behind your head and down toward the floor while keeping your arms slightly bent.",
      "Pull the dumbbell back up and over your chest to the starting position.",
      "Exhale as you pull up, inhale as you lower.",
      "This exercise targets your chest and back muscles."
    ]
  },
  {
    "name": "Push Press",
    "category": "Shoulders",
    "equipment": "Barbell",
    "type": "weight",
    "image": "pushpress.png",
    "image_detail": "pushpress-detail.jpg",
    "description": [
      "Hold a barbell at shoulder height with your palms facing forward and your elbows bent.",
      "Bend your knees slightly and use your legs to help press the barbell overhead.",
      "Fully extend your arms and lock out your elbows at the top of the movement.",
      "Lower the barbell back to shoulder height with control.",
      "Exhale as you press, inhale as you lower.",
      "This exercise engages your shoulders and leg muscles."
    ]
  },
  {
    "name": "Push Up",
    "category": "Chest",
    "equipment": "",
    "type": "weight",
    "image": "pushup.png",
    "image_detail": "pushup-detail.jpg",
    "description": [
      "Start in a plank position with your hands placed slightly wider than shoulder-width apart.",
      "Lower your body by bending your elbows while keeping your body in a straight line.",
      "Push your body back up to the starting position.",
      "Exhale as you push up, inhale as you lower.",
      "This exercise primarily targets your chest muscles."
    ]
  },
  {
    "name": "Push Up - Knees",
    "category": "Chest",
    "equipment": "",
    "type": "weight",
    "image": "pushupknees.png",
    "image_detail": "pushupknees-detail.jpg",
    "description": [
      "Start in a plank position with your knees on the ground and your hands placed slightly wider than shoulder-width apart.",
      "Lower your body by bending your elbows while keeping your body in a straight line.",
      "Push your body back up to the starting position.",
      "Exhale as you push up, inhale as you lower.",
      "This modified push-up is a beginner-friendly variation that targets your chest muscles."
    ]
  },
  {
    "name": "Reverse Crunch",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "reversecrunch.png",
    "image_detail": "reversecrunch-detail.jpg",
    "description": [
      "Lie on your back with your hands by your sides or under your hips for support.",
      "Lift your legs off the ground and bring your knees towards your chest.",
      "Curl your hips off the floor and lift your tailbone towards the ceiling.",
      "Lower your legs back down without letting them touch the ground completely.",
      "Exhale as you curl, inhale as you release.",
      "This exercise targets your lower abdominal muscles."
    ]
  },
  {
    "name": "Reverse Curl",
    "category": "Biceps",
    "equipment": "Barbell",
    "type": "weight",
    "image": "reversecurlbb.png",
    "image_detail": "reversecurlbb-detail.jpg",
    "description": [
      "Lie on a bench or mat with a barbell positioned above your head.",
      "Grasp the barbell with an overhand grip, hands shoulder-width apart.",
      "Curl the barbell towards your forehead while keeping your upper arms stationary.",
      "Lower the barbell back to the starting position with control.",
      "Exhale as you curl, inhale as you release.",
      "This exercise targets your biceps."
    ]
  },
  {
    "name": "Reverse Curl",
    "category": "Biceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "reversecurldb.png",
    "image_detail": "reversecurldb-detail.jpg",
    "description": [
      "Stand or sit with a dumbbell in each hand, arms fully extended by your sides.",
      "Curl the dumbbells towards your shoulders while keeping your upper arms stationary.",
      "Lower the dumbbells back to the starting position with control.",
      "Exhale as you curl, inhale as you release.",
      "This exercise targets your biceps."
    ]
  },
  {
    "name": "Reverse Curl",
    "category": "Biceps",
    "equipment": "Band",
    "type": "weight",
    "image": "reversecurlband.png",
    "image_detail": "reversecurlband-detail.jpg",
    "description": [
      "Step on a resistance band with both feet and grasp the ends with your hands.",
      "Stand upright with your arms fully extended by your sides.",
      "Curl the resistance band towards your shoulders while keeping your upper arms stationary.",
      "Lower the resistance band back to the starting position with control.",
      "Exhale as you curl, inhale as you release.",
      "This exercise with a resistance band targets your biceps."
    ]
  },
  {
    "name": "Reverse Fly",
    "category": "Back",
    "equipment": "Machine",
    "type": "weight",
    "image": "reversefly.png",
    "image_detail": "reversefly-detail.jpg",
    "description": [
      "Sit at the reverse fly machine with your chest against the pad.",
      "Grasp the handles with an overhand grip and extend your arms forward.",
      "Squeeze your shoulder blades together as you pull the handles out to the sides.",
      "Slowly release the handles to return to the starting position.",
      "Exhale as you squeeze, inhale as you release.",
      "This exercise targets your rear deltoids and upper back."
    ]
  },
  {
    "name": "Reverse Fly",
    "category": "Back",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "reverseflydb.png",
    "image_detail": "reverseflydb-detail.jpg",
    "description": [
      "Stand with a dumbbell in each hand and arms fully extended by your sides.",
      "Bend at the hips and knees slightly, keeping your back straight.",
      "Raise your arms out to the sides until they are parallel to the ground.",
      "Slowly lower the dumbbells back to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets your rear deltoids and upper back."
    ]
  },
  {
    "name": "Reverse Grip Concentration Curl",
    "category": "Biceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "reversegripconcentrationcurldb.png",
    "image_detail": "reversegripconcentrationcurldb-detail.jpg",
    "description": [
      "Sit on a bench and hold a dumbbell in one hand between your legs.",
      "Lean forward, placing your elbow against your inner thigh and your palm facing up.",
      "Curl the dumbbell towards your shoulder while keeping your upper arm stationary.",
      "Lower the dumbbell back to the starting position with control.",
      "Exhale as you curl, inhale as you release.",
      "This exercise with a reverse grip targets your biceps."
    ]
  },
  {
    "name": "Romanian Deadlift",
    "category": "Back",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "romaniandeadliftdb.png",
    "image_detail": "romaniandeadliftdb-detail.jpg",
    "description": [
      "Stand with a dumbbell in each hand, arms fully extended by your sides.",
      "Maintain a slight bend in your knees as you hinge at the hips to lower the dumbbells.",
      "Lower the dumbbells along your thighs, keeping your back straight and chest up.",
      "Return to the upright position by squeezing your glutes and extending your hips.",
      "Exhale as you stand up, inhale as you lower.",
      "This exercise targets your hamstrings and lower back."
    ]
  },
  {
    "name": "Rowing",
    "category": "Cardio",
    "equipment": "",
    "type": "time",
    "image": "rowingmachine.png",
    "image_detail": "rowingmachine-detail.jpg",
    "description": [
      "Sit on a rowing machine with your feet secured in the footrests.",
      "Grasp the handlebar with an overhand grip and slightly bend your knees.",
      "Push off with your legs, followed by a pull of the handlebar towards your abdomen.",
      "Lean back slightly and engage your core as you perform the rowing motion.",
      "Extend your arms and bend your knees to return to the starting position.",
      "This exercise provides a full-body cardio and strength workout."
    ]
  },
  {
    "name": "Running",
    "category": "Cardio",
    "equipment": "",
    "type": "time",
    "image": "running.png",
    "image_detail": "running-detail.jpg",
    "description": [
      "Run at a comfortable pace either outdoors or on a treadmill.",
      "Maintain good posture and breathe evenly throughout the run.",
      "You can adjust the intensity by changing your speed or incline.",
      "Running is an effective cardiovascular exercise that also engages your leg muscles."
    ]
  },
  {
    "name": "Running",
    "category": "Cardio",
    "equipment": "Machine",
    "type": "time",
    "image": "runningtreadmill.png",
    "image_detail": "runningtreadmill-detail.jpg",
    "description": [
      "Use a treadmill to simulate running indoors.",
      "Start by setting your desired speed and incline level.",
      "Maintain good posture and breathe evenly throughout the run.",
      "You can adjust the intensity by changing your speed or incline.",
      "Running on a treadmill provides cardiovascular benefits and engages your leg muscles."
    ]
  },
  {
    "name": "Russian Twist",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "russiantwist.png",
    "image_detail": "russiantwist-detail.jpg",
    "description": [
      "Sit on the floor with your knees bent and your feet flat on the ground.",
      "Lean back slightly and lift your feet off the ground, balancing on your sit bones.",
      "Hold a weight or medicine ball with both hands in front of you.",
      "Rotate your torso to the right, then to the left, while keeping your core engaged.",
      "Exhale as you twist, inhale as you return to the center.",
      "This exercise targets your oblique muscles."
    ]
  },
  {
    "name": "Seated Calf Raise",
    "category": "Calves",
    "equipment": "Plate Loaded",
    "type": "weight",
    "image": "seatedcalfraise.png",
    "image_detail": "seatedcalfraise-detail.jpg",
    "description": [
      "Sit at a calf raise machine with your feet on the platform and your knees bent.",
      "Place a weight plate on your thighs, holding it securely with your hands.",
      "Raise your heels by extending your ankles as high as possible.",
      "Lower your heels back down to the starting position.",
      "Exhale as you lift, inhale as you lower.",
      "This exercise targets your calf muscles."
    ]
  },
  {
    "name": "Seated Leg Press",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "seatedlegpressmachine.png",
    "image_detail": "seatedlegpressmachine-detail.jpg",
    "description": [
      "Sit on a leg press machine with your back against the backrest.",
      "Place your feet on the platform hip-width apart.",
      "Push the platform forward by extending your knees and hips.",
      "Lower the platform back down to the starting position.",
      "Exhale as you push, inhale as you release.",
      "This exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Seated Overhead Press",
    "category": "Shoulders",
    "equipment": "Barbell",
    "type": "weight",
    "image": "seatedoverheadpressbb.png",
    "image_detail": "seatedoverheadpressbb-detail.jpg",
    "description": [
      "Sit on a bench with a backrest and grasp the barbell with a wide overhand grip.",
      "Press the barbell overhead until your arms are fully extended.",
      "Lower the barbell back to shoulder level with control.",
      "Exhale as you press, inhale as you release.",
      "This exercise targets your shoulders and triceps."
    ]
  },
  {
    "name": "Seated Overhead Press",
    "category": "Shoulders",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "seatedoverheadpressdb.png",
    "image_detail": "seatedoverheadpressdb-detail.jpg",
    "description": [
      "Sit on a bench with a backrest and hold a dumbbell in each hand at shoulder height.",
      "Press the dumbbells overhead until your arms are fully extended.",
      "Lower the dumbbells back to shoulder level with control.",
      "Exhale as you press, inhale as you release.",
      "This exercise targets your shoulders and triceps."
    ]
  },
  {
    "name": "Seated Palms Up Wrist Curl",
    "category": "Forearms",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "seatedpalmsupwristcurl.png",
    "image_detail": "seatedpalmsupwristcurl-detail.jpg",
    "description": [
      "Sit on a bench with your forearms resting on your thighs and palms facing up.",
      "Hold a dumbbell in each hand with your wrists hanging off your knees.",
      "Curl the dumbbells towards your forearms by flexing your wrists.",
      "Lower the dumbbells back down with control.",
      "Exhale as you curl, inhale as you release.",
      "This exercise targets your forearm muscles."
    ]
  },
  {
    "name": "Seated Row",
    "category": "Back",
    "equipment": "Cable",
    "type": "weight",
    "image": "seatedrow.png",
    "image_detail": "seatedrow-detail.jpg",
    "description": [
      "Sit at a rowing machine with your knees slightly bent and feet against the footrests.",
      "Grasp the handle with both hands, arms fully extended.",
      "Pull the handle towards your abdomen while squeezing your shoulder blades.",
      "Extend your arms forward to return to the starting position.",
      "Exhale as you pull, inhale as you release.",
      "This exercise targets your upper back and biceps."
    ]
  },
  {
    "name": "Seated Row",
    "category": "Back",
    "equipment": "Machine",
    "type": "weight",
    "image": "seatedrowmachine.png",
    "image_detail": "seatedrowmachine-detail.jpg",
    "description": [
      "Sit at a rowing machine with your knees slightly bent and feet against the footrests.",
      "Grasp the handles with an overhand grip, arms fully extended.",
      "Pull the handles towards your abdomen while squeezing your shoulder blades.",
      "Extend your arms forward to return to the starting position.",
      "Exhale as you pull, inhale as you release.",
      "This exercise targets your upper back and biceps."
    ]
  },
  {
    "name": "Seated Row - Wide Grip",
    "category": "Back",
    "equipment": "Cable",
    "type": "weight",
    "image": "seatedwidegriprowcable.png",
    "image_detail": "seatedwidegriprowcable-detail.jpg",
    "description": [
      "Sit at a rowing machine with your knees slightly bent and feet against the footrests.",
      "Grasp the wide grip handle with both hands, arms fully extended.",
      "Pull the handle towards your abdomen while squeezing your shoulder blades.",
      "Extend your arms forward to return to the starting position.",
      "Exhale as you pull, inhale as you release.",
      "This exercise targets your upper back and biceps with a wider grip."
    ]
  },
  {
    "name": "Shoulder Press",
    "category": "Shoulders",
    "equipment": "Machine",
    "type": "weight",
    "image": "shoulderpressmachine.png",
    "image_detail": "shoulderpressmachine-detail.jpg",
    "description": [
      "Sit on the machine's seat with your back against the backrest.",
      "Grasp the handles with an overhand grip at shoulder height.",
      "Press the handles overhead until your arms are fully extended.",
      "Lower the handles back to shoulder level with control.",
      "Exhale as you press, inhale as you release.",
      "This machine exercise targets your shoulders and triceps."
    ]
  },
  {
    "name": "Shoulder Press",
    "category": "Shoulders",
    "equipment": "Plate Loaded",
    "type": "weight",
    "image": "shoulderpressplateloaded.png",
    "image_detail": "shoulderpressplateloaded-detail.jpg",
    "description": [
      "Sit on the machine's seat with your back against the backrest.",
      "Grasp the handles with an overhand grip at shoulder height.",
      "Press the handles overhead until your arms are fully extended.",
      "Lower the handles back to shoulder level with control.",
      "Exhale as you press, inhale as you release.",
      "This plate-loaded machine exercise targets your shoulders and triceps."
    ]
  },
  {
    "name": "Shrug",
    "category": "Shoulders",
    "equipment": "Machine",
    "type": "weight",
    "image": "shrugmachine.png",
    "image_detail": "shrugmachine-detail.jpg",
    "description": [
      "Stand inside the machine with your shoulders directly under the pads.",
      "Grasp the handles with an overhand grip and stand up straight.",
      "Lift your shoulders towards your ears as high as possible.",
      "Lower your shoulders back down with control.",
      "Exhale as you lift, inhale as you release.",
      "This machine exercise targets your trapezius muscles."
    ]
  },
  {
    "name": "Shrug",
    "category": "Shoulders",
    "equipment": "Smith Machine",
    "type": "weight",
    "image": "shrugsmithmachine.png",
    "image_detail": "shrugsmithmachine-detail.jpg",
    "description": [
      "Stand inside the Smith machine with your shoulders directly under the bar.",
      "Grasp the barbell with an overhand grip and stand up straight.",
      "Lift your shoulders towards your ears as high as possible.",
      "Lower your shoulders back down with control.",
      "Exhale as you lift, inhale as you release.",
      "This Smith machine exercise targets your trapezius muscles."
    ]
  },
  {
    "name": "Shrug",
    "category": "Shoulders",
    "equipment": "Barbell",
    "type": "weight",
    "image": "shrugbb.png",
    "image_detail": "shrugbb-detail.jpg",
    "description": [
      "Hold a barbell with an overhand grip and stand up straight.",
      "Lift your shoulders towards your ears as high as possible.",
      "Lower your shoulders back down with control.",
      "Exhale as you lift, inhale as you release.",
      "This barbell exercise targets your trapezius muscles."
    ]
  },
  {
    "name": "Shrug",
    "category": "Shoulders",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "shrugdb.png",
    "image_detail": "shrugdb-detail.jpg",
    "description": [
      "Hold a dumbbell in each hand and stand up straight.",
      "Lift your shoulders towards your ears as high as possible.",
      "Lower your shoulders back down with control.",
      "Exhale as you lift, inhale as you release.",
      "This dumbbell exercise targets your trapezius muscles."
    ]
  },
  {
    "name": "Side Bend",
    "category": "Core",
    "equipment": "Band",
    "type": "weight",
    "image": "sidebend.png",
    "image_detail": "sidebend-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart and grasp the band with both hands.",
      "Hold the band overhead with one hand and let it hang on the opposite side.",
      "Slowly bend to the side with the band, keeping your core engaged.",
      "Return to the upright position.",
      "Exhale as you bend, inhale as you return.",
      "This exercise targets your oblique muscles."
    ]
  },
  {
    "name": "Side Bend",
    "category": "Core",
    "equipment": "Cable",
    "type": "weight",
    "image": "sidebendcable.png",
    "image_detail": "sidebendcable-detail.jpg",
    "description": [
      "Attach a D-handle to a low pulley on a cable machine.",
      "Stand sideways to the machine and grasp the handle with one hand.",
      "Slowly bend to the side away from the machine, keeping your core engaged.",
      "Return to the upright position.",
      "Exhale as you bend, inhale as you return.",
      "This cable exercise targets your oblique muscles."
    ]
  },
  {
    "name": "Side Bend",
    "category": "Core",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "sidebenddb.png",
    "image_detail": "sidebenddb-detail.jpg",
    "description": [
      "Hold a dumbbell in one hand and stand up straight.",
      "Slowly bend to the side with the dumbbell, keeping your core engaged.",
      "Return to the upright position.",
      "Exhale as you bend, inhale as you return.",
      "This dumbbell exercise targets your oblique muscles."
    ]
  },
  {
    "name": "Side Plank",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "sideplank.png",
    "image_detail": "sideplank-detail.jpg",
    "description": [
      "Lie on your side with your legs straight and your elbow directly under your shoulder.",
      "Lift your hips off the ground, creating a straight line from head to heels.",
      "Engage your core and hold the position for the desired time.",
      "Switch to the other side and repeat.",
      "Breathe evenly throughout the exercise.",
      "This exercise targets your oblique muscles and core stability."
    ]
  },
  {
    "name": "Single Leg Bridge",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "singlelegbridge.png",
    "image_detail": "singlelegbridge-detail.jpg",
    "description": [
      "Lie on your back with your knees bent and feet flat on the floor.",
      "Lift one leg off the ground and extend it straight.",
      "Push through the heel of the grounded foot to lift your hips off the ground.",
      "Lower your hips back down with control.",
      "Exhale as you lift, inhale as you release.",
      "This exercise targets your glutes and hamstrings."
    ]
  },
  {
    "name": "Sit Ups",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "situp.png",
    "image_detail": "situp-detail.jpg",
    "description": [
      "Lie on your back with your knees bent and feet flat on the floor.",
      "Cross your arms over your chest or place your hands behind your head.",
      "Engage your core and lift your upper body off the ground.",
      "Lower your upper body back down to the starting position.",
      "Exhale as you lift, inhale as you release.",
      "This exercise targets your abdominal muscles."
    ]
  },
  {
    "name": "Skullcrusher",
    "category": "Triceps",
    "equipment": "Barbell",
    "type": "weight",
    "image": "skullcrusherbb.png",
    "image_detail": "skullcrusherbb-detail.jpg",
    "description": [
      "Lie on a bench with your feet flat on the floor and hold a barbell with an overhand grip.",
      "Extend your arms straight up over your chest.",
      "Bend your elbows to lower the barbell towards your forehead.",
      "Extend your elbows to press the barbell back up.",
      "Exhale as you press, inhale as you release.",
      "This barbell exercise targets your triceps."
    ]
  },
  {
    "name": "Skullcrusher",
    "category": "Triceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "skullcrusherdb.png",
    "image_detail": "skullcrusherdb-detail.jpg",
    "description": [
      "Lie on a bench with your feet flat on the floor and hold a dumbbell in each hand.",
      "Extend your arms straight up over your chest.",
      "Bend your elbows to lower the dumbbells towards your temples.",
      "Extend your elbows to press the dumbbells back up.",
      "Exhale as you press, inhale as you release.",
      "This dumbbell exercise targets your triceps."
    ]
  },
  {
    "name": "Snatch",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "snatchbb.png",
    "image_detail": "snatchbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart and a barbell on the ground in front of you.",
      "Bend at your hips and knees to grasp the barbell with an overhand grip.",
      "Lift the barbell explosively while extending your hips and knees.",
      "As the barbell rises, pull it overhead and squat underneath it.",
      "Catch the barbell in an overhead squat position and stand up.",
      "Exhale as you lift, inhale as you release.",
      "The snatch is a complex Olympic lift targeting multiple muscle groups."
    ]
  },
  {
    "name": "Snatch Pull",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "snatchpullbb.png",
    "image_detail": "snatchpullbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart and a barbell on the ground in front of you.",
      "Bend at your hips and knees to grasp the barbell with an overhand grip.",
      "Lift the barbell explosively while extending your hips and knees.",
      "Keep your elbows high and pull the barbell as high as possible.",
      "Lower the barbell back to the ground with control.",
      "Exhale as you pull, inhale as you release.",
      "The snatch pull is an Olympic weightlifting exercise that targets explosive power."
    ]
  },
  {
    "name": "Split Jerk",
    "category": "Olympic",
    "equipment": "Barbell",
    "type": "weight",
    "image": "splitjerkbb.png",
    "image_detail": "splitjerkbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart and a barbell on your shoulders.",
      "Bend your knees slightly and perform a split stance with one foot forward.",
      "Dip down by bending your knees and hips.",
      "Explosively extend your knees and hips while pressing the barbell overhead.",
      "Drop into a lunge position with the opposite foot forward.",
      "Return to a standing position with the barbell overhead.",
      "Exhale as you press, inhale as you release.",
      "The split jerk is an Olympic weightlifting technique targeting multiple muscle groups."
    ]
  },
  {
    "name": "Squat",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "squatbw.png",
    "image_detail": "squatbw-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart and your arms extended in front of you.",
      "Bend at your hips and knees to lower your body down into a squat.",
      "Keep your back straight and chest up as you lower.",
      "Push through your heels to stand back up.",
      "Exhale as you rise, inhale as you lower.",
      "This bodyweight squat exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Squat",
    "category": "Legs",
    "equipment": "Barbell",
    "type": "weight",
    "image": "squatbb.png",
    "image_detail": "squatbb-detail.jpg",
    "description": [
      "Stand with your feet shoulder-width apart and a barbell on your upper back.",
      "Bend at your hips and knees to lower your body down into a squat.",
      "Keep your back straight and chest up as you lower.",
      "Push through your heels to stand back up.",
      "Exhale as you rise, inhale as you lower.",
      "This barbell squat exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Squat",
    "category": "Legs",
    "equipment": "Machine",
    "type": "weight",
    "image": "squatemachine.png",
    "image_detail": "squatemachine-detail.jpg",
    "description": [
      "Sit on a squat machine with your back against the backrest.",
      "Place your feet shoulder-width apart on the platform.",
      "Press through your feet to lift the platform and stand up.",
      "Lower the platform back down by bending your knees.",
      "Exhale as you press, inhale as you release.",
      "This machine squat exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Squat",
    "category": "Legs",
    "equipment": "Smith Machine",
    "type": "weight",
    "image": "squatsmithmachine.png",
    "image_detail": "squatsmithmachine-detail.jpg",
    "description": [
      "Stand inside the Smith machine with your back against the bar.",
      "Place your feet shoulder-width apart under the bar.",
      "Grasp the barbell with an overhand grip and unhook it from the rack.",
      "Bend at your hips and knees to lower your body down into a squat.",
      "Keep your back straight and chest up as you lower.",
      "Push through your heels to stand back up.",
      "Exhale as you rise, inhale as you lower.",
      "This Smith machine squat exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Squat",
    "category": "Legs",
    "equipment": "Band",
    "type": "weight",
    "image": "squatband.png",
    "image_detail": "squatband-detail.jpg",
    "description": [
      "Place a resistance band around your thighs, just above your knees.",
      "Stand with your feet shoulder-width apart and your arms extended in front of you.",
      "Bend at your hips and knees to lower your body down into a squat.",
      "Keep tension on the band throughout the movement.",
      "Push through your heels to stand back up.",
      "Exhale as you rise, inhale as you lower.",
      "This banded squat exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Squat",
    "category": "Legs",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "squatdb.png",
    "image_detail": "squatdb-detail.jpg",
    "description": [
      "Hold a dumbbell in each hand at shoulder height and stand with your feet shoulder-width apart.",
      "Bend at your hips and knees to lower your body down into a squat.",
      "Keep your back straight and chest up as you lower.",
      "Push through your heels to stand back up.",
      "Exhale as you rise, inhale as you lower.",
      "This dumbbell squat exercise targets your quadriceps, hamstrings, and glutes."
    ]
  },
  {
    "name": "Standing Calf Raise",
    "category": "Calves",
    "equipment": "",
    "type": "weight",
    "image": "standingcalfraisebw.png",
    "image_detail": "standingcalfraisebw-detail.jpg",
    "description": [
      "Stand with the balls of your feet on an elevated surface, such as a step.",
      "Hold onto a stable object for balance.",
      "Raise your heels as high as possible by extending your ankles.",
      "Lower your heels back down to stretch your calf muscles.",
      "Exhale as you lift, inhale as you release.",
      "This bodyweight exercise targets your calf muscles."
    ]
  },
  {
    "name": "Standing Calf Raise",
    "category": "Calves",
    "equipment": "Barbell",
    "type": "weight",
    "image": "standingcalfraisebb.png",
    "image_detail": "standingcalfraisebb-detail.jpg",
    "description": [
      "Place a barbell across your upper back and stand with the balls of your feet on an elevated surface.",
      "Hold onto a stable object for balance.",
      "Raise your heels as high as possible by extending your ankles.",
      "Lower your heels back down to stretch your calf muscles.",
      "Exhale as you lift, inhale as you release.",
      "This barbell exercise targets your calf muscles."
    ]
  },
  {
    "name": "Standing Calf Raise",
    "category": "Calves",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "standingcalfraisedb.png",
    "image_detail": "standingcalfraisedb-detail.jpg",
    "description": [
      "Hold a dumbbell in one hand and stand with the balls of your feet on an elevated surface.",
      "Hold onto a stable object for balance.",
      "Raise your heels as high as possible by extending your ankles.",
      "Lower your heels back down to stretch your calf muscles.",
      "Exhale as you lift, inhale as you release.",
      "This dumbbell exercise targets your calf muscles."
    ]
  },
  {
    "name": "Standing Calf Raise",
    "category": "Calves",
    "equipment": "Machine",
    "type": "weight",
    "image": "standingcalfraisemachine.png",
    "image_detail": "standingcalfraisemachine-detail.jpg",
    "description": [
      "Use a standing calf raise machine and place your shoulders under the pads.",
      "Place the balls of your feet on the platform and your heels off the edge.",
      "Raise your heels as high as possible by extending your ankles.",
      "Lower your heels back down to stretch your calf muscles.",
      "Exhale as you lift, inhale as you release.",
      "This machine exercise targets your calf muscles."
    ]
  },
  {
    "name": "Standing Calf Raise",
    "category": "Calves",
    "equipment": "Smith Machine",
    "type": "weight",
    "image": "standingcalfraisesmithmachine.png",
    "image_detail": "standingcalfraisesmithmachine-detail.jpg",
    "description": [
      "Use a Smith machine and place your shoulders under the bar.",
      "Place the balls of your feet on the platform and your heels off the edge.",
      "Raise your heels as high as possible by extending your ankles.",
      "Lower your heels back down to stretch your calf muscles.",
      "Exhale as you lift, inhale as you release.",
      "This Smith machine exercise targets your calf muscles."
    ]
  },
  {
    "name": "Step-Up",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "stepup.png",
    "image_detail": "stepup-detail.jpg",
    "description": [
      "Stand in front of a step or bench.",
      "Step onto the platform with one foot and lift your body up.",
      "Extend your hip and knee of the elevated leg.",
      "Step down with the elevated leg and return to the starting position.",
      "Switch to the other leg and repeat.",
      "Exhale as you step up, inhale as you step down.",
      "This exercise targets your quadriceps and glutes."
    ]
  },
  {
    "name": "Step-Up",
    "category": "Legs",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "stepupdb.png",
    "image_detail": "stepupdb-detail.jpg",
    "description": [
      "Hold a dumbbell in each hand and stand in front of a step or bench.",
      "Step onto the platform with one foot and lift your body up.",
      "Extend your hip and knee of the elevated leg.",
      "Step down with the elevated leg and return to the starting position.",
      "Switch to the other leg and repeat.",
      "Exhale as you step up, inhale as you step down.",
      "This dumbbell exercise targets your quadriceps and glutes."
    ]
  },
  {
    "name": "Stiff Leg Deadlift",
    "category": "Legs",
    "equipment": "Barbell",
    "type": "weight",
    "image": "stifflegdeadliftbb.png",
    "image_detail": "stifflegdeadliftbb-detail.jpg",
    "description": [
      "Stand with your feet hip-width apart and a barbell in front of you on the ground.",
      "Hold the barbell with an overhand grip and a hip-width stance.",
      "Bend at your hips while keeping your back straight.",
      "Lower the barbell towards the ground while feeling a stretch in your hamstrings.",
      "Extend your hips and return to the starting position.",
      "Exhale as you extend, inhale as you bend.",
      "This barbell exercise targets your hamstrings and lower back."
    ]
  },
  {
    "name": "Stiff Leg Deadlift",
    "category": "Legs",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "stifflegdeadliftdb.png",
    "image_detail": "stifflegdeadliftdb-detail.jpg",
    "description": [
      "Hold a dumbbell in each hand and stand with your feet hip-width apart.",
      "Hold the dumbbells in front of your thighs with your palms facing your body.",
      "Bend at your hips while keeping your back straight.",
      "Lower the dumbbells towards the ground while feeling a stretch in your hamstrings.",
      "Extend your hips and return to the starting position.",
      "Exhale as you extend, inhale as you bend.",
      "This dumbbell exercise targets your hamstrings and lower back."
    ]
  },
  {
    "name": "Straight Leg Deadlift",
    "category": "Legs",
    "equipment": "Band",
    "type": "weight",
    "image": "straightlegdeadliftband.png",
    "image_detail": "straightlegdeadliftband-detail.jpg",
    "description": [
      "Place a resistance band around your feet and hold the ends in your hands.",
      "Stand with your feet hip-width apart and your knees slightly bent.",
      "Bend at your hips while keeping your back straight.",
      "Lower your upper body towards the ground while feeling a stretch in your hamstrings.",
      "Engage your hamstrings and glutes to return to the starting position.",
      "Exhale as you extend, inhale as you bend.",
      "This banded exercise targets your hamstrings and lower back."
    ]
  },
  {
    "name": "Stretching",
    "category": "Other",
    "equipment": "",
    "type": "weight",
    "image": "stretching.png",
    "image_detail": "stretching-detail.jpg",
    "description": [
      "Perform static stretches to improve flexibility and range of motion.",
      "Hold each stretch for about 15-30 seconds, avoiding bouncing.",
      "Focus on major muscle groups such as hamstrings, quadriceps, calves, chest, and shoulders.",
      "Breathe deeply and relax into the stretch without causing discomfort.",
      "Stretching helps with muscle recovery and overall flexibility."
    ]
  },
  {
    "name": "Sumo Deadlift",
    "category": "Legs",
    "equipment": "Barbell",
    "type": "weight",
    "image": "sumodeadliftbb.png",
    "image_detail": "sumodeadliftbb-detail.jpg",
    "description": [
      "Stand with your feet wider than shoulder-width apart and a barbell on the ground in front of you.",
      "Point your toes slightly outward and grasp the barbell with a wide grip.",
      "Bend at your hips and knees while keeping your back straight.",
      "Lift the barbell by extending your hips and knees.",
      "Lower the barbell back to the ground with control.",
      "Exhale as you lift, inhale as you release.",
      "This barbell exercise targets your quadriceps, hamstrings, and lower back."
    ]
  },
  {
    "name": "Sumo Deadlift High Pull",
    "category": "Full Body",
    "equipment": "Barbell",
    "type": "weight",
    "image": "sumodeadlifthighpullbb.png",
    "image_detail": "sumodeadlifthighpullbb-detail.jpg",
    "description": [
      "Stand with your feet wider than shoulder-width apart and a barbell on the ground in front of you.",
      "Point your toes slightly outward and grasp the barbell with a wide grip.",
      "Bend at your hips and knees while keeping your back straight.",
      "Lift the barbell by extending your hips and knees.",
      "As the barbell rises, pull it towards your upper chest by bending your elbows.",
      "Lower the barbell back to the ground with control.",
      "Exhale as you lift and pull, inhale as you release.",
      "This barbell exercise targets multiple muscle groups including legs, back, and shoulders."
    ]
  },
  {
    "name": "Superman",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "superman.png",
    "image_detail": "superman-detail.jpg",
    "description": [
      "This exercise targets the muscles of the lower back and helps improve spinal extension.",
      "Lie face down on an exercise mat or the floor with your arms extended in front of you.",
      "Simultaneously lift your arms, chest, and legs off the floor as high as you comfortably can.",
      "Hold the position for a brief pause, focusing on contracting your lower back muscles.",
      "Slowly lower your arms, chest, and legs back down to the starting position."
    ]
  },
  {
    "name": "T Bar Row",
    "category": "Back",
    "equipment": "",
    "type": "weight",
    "image": "tbarrow.png",
    "image_detail": "tbarrow-detail.jpg",
    "description": [
      "This compound exercise targets the upper back muscles and helps improve overall back strength.",
      "Stand with your feet shoulder-width apart and knees slightly bent.",
      "Bend at your hips to grasp the T-bar handle with an overhand grip.",
      "Keep your back straight and chest up as you pull the T-bar towards your lower abdomen.",
      "Squeeze your shoulder blades together at the top of the movement.",
      "Slowly lower the T-bar back to the starting position, keeping tension on the muscles."
    ]
  },
  {
    "name": "Thruster",
    "category": "Full Body",
    "equipment": "Kettlebell",
    "type": "weight",
    "image": "thrusterkettlebell.png",
    "image_detail": "thrusterkettlebell-detail.jpg",
    "description": [
      "The thruster is a compound movement that combines a front squat and overhead press.",
      "Hold a kettlebell at shoulder height with your palms facing each other.",
      "Squat down by bending your knees and hips, keeping your back straight.",
      "As you stand up from the squat, press the kettlebell overhead by extending your arms.",
      "Lower the kettlebell back to shoulder height as you descend into the next squat repetition."
    ]
  },
  {
    "name": "Toes To Bar",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "toestobar.png",
    "image_detail": "toestobar-detail.jpg",
    "description": [
      "This exercise targets the core muscles and requires strong abdominal engagement.",
      "Hang from a pull-up bar with an overhand grip, arms fully extended.",
      "Simultaneously lift your legs and knees up towards the bar while keeping them straight.",
      "At the top of the movement, touch the bar with your toes.",
      "Lower your legs back down with control to complete one repetition."
    ]
  },
  {
    "name": "Trap Bar Deadlift",
    "category": "Legs",
    "equipment": "",
    "type": "weight",
    "image": "trapbardeadlift.png",
    "image_detail": "trapbardeadlift-detail.jpg",
    "description": [
      "The trap bar deadlift is a variation of the traditional deadlift using a hexagonal barbell.",
      "Stand inside the trap bar with your feet hip-width apart.",
      "Bend at your hips and knees to grip the handles of the trap bar.",
      "Keep your back straight and chest up as you lift the bar by straightening your hips and knees.",
      "Lower the bar back to the ground with control, maintaining a neutral spine."
    ]
  },
  {
    "name": "Triceps Dip",
    "category": "Triceps",
    "equipment": "",
    "type": "weight",
    "image": "tricepsdip.png",
    "image_detail": "tricepsdip-detail.jpg",
    "description": [
      "Triceps dips primarily target the triceps muscles and also engage the shoulders and chest.",
      "Position your hands on parallel bars or stable surfaces with your fingers pointing forward.",
      "Lower your body by bending your elbows until your upper arms are parallel to the ground.",
      "Push through your palms to extend your arms and return to the starting position."
    ]
  },
  {
    "name": "Triceps Dip - Assisted",
    "category": "Triceps",
    "equipment": "Machine",
    "type": "weight",
    "image": "tricepsdipassisted.png",
    "image_detail": "tricepsdipassisted-detail.jpg",
    "description": [
      "This version of triceps dips uses an assisted machine to make the exercise easier.",
      "Adjust the machine to your desired weight assistance and follow the steps of a regular triceps dip."
    ]
  },
  {
    "name": "Triceps Extension",
    "category": "Triceps",
    "equipment": "Barbell",
    "type": "weight",
    "image": "tricepsextensionbb.png",
    "image_detail": "tricepsextensionbb-detail.jpg",
    "description": [
      "Triceps extensions isolate and target the triceps muscles for strength and definition.",
      "Hold a barbell with an overhand grip and extend your arms overhead.",
      "Bend your elbows to lower the barbell behind your head.",
      "Extend your elbows to lift the barbell back to the starting position."
    ]
  },
  {
    "name": "Triceps Extension",
    "category": "Triceps",
    "equipment": "Cable",
    "type": "weight",
    "image": "tricepsextension.png",
    "image_detail": "tricepsextension-detail.jpg",
    "description": [
      "Triceps extensions with a cable machine isolate and strengthen the triceps muscles.",
      "Attach a rope handle to a high cable pulley and grip it with both hands.",
      "Stand facing the cable machine and extend your arms downward.",
      "Bend your elbows to lower the rope behind your head while keeping your upper arms still.",
      "Extend your arms to return to the starting position."
    ]
  },
  {
    "name": "Triceps Extension",
    "category": "Triceps",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "tricepsextensiondb.png",
    "image_detail": "tricepsextensiondb-detail.jpg",
    "description": [
      "Dumbbell triceps extensions are an effective way to target and build the triceps muscles.",
      "Hold a dumbbell in one hand and extend your arm overhead.",
      "Bend your elbow to lower the dumbbell behind your head.",
      "Extend your arm to lift the dumbbell back up to the starting position."
    ]
  },
  {
    "name": "Triceps Pushdown",
    "category": "Triceps",
    "equipment": "Cable",
    "type": "weight",
    "image": "tricepspushdowncable.png",
    "image_detail": "tricepspushdowncable-detail.jpg",
    "description": [
      "Triceps pushdowns with a cable machine effectively target the triceps muscles.",
      "Attach a straight or V-bar handle to a high cable pulley and grasp it with an overhand grip.",
      "Stand facing the cable machine and keep your elbows close to your sides.",
      "Push the handle down until your arms are fully extended, focusing on contracting your triceps.",
      "Slowly release the handle to return to the starting position."
    ]
  },
  {
    "name": "Upright Row",
    "category": "Shoulders",
    "equipment": "Barbell",
    "type": "weight",
    "image": "uprightrowbb.png",
    "image_detail": "uprightrowbb-detail.jpg",
    "description": [
      "Upright rows target the deltoids and upper traps, contributing to shoulder and upper back development.",
      "Hold a barbell with an overhand grip, hands slightly narrower than shoulder-width.",
      "Lift the barbell towards your chin, leading with your elbows, keeping it close to your body.",
      "Lower the barbell back down in a controlled manner."
    ]
  },
  {
    "name": "Upright Row",
    "category": "Shoulders",
    "equipment": "Cable",
    "type": "weight",
    "image": "uprightrowcable.png",
    "image_detail": "uprightrowcable-detail.jpg",
    "description": [
      "Using a cable machine adds resistance to the upright row exercise for shoulder and upper back strengthening.",
      "Attach a straight bar to a low cable pulley and grip it with an overhand grip.",
      "Pull the bar towards your chin while keeping it close to your body.",
      "Control the descent as you lower the bar back to the starting position."
    ]
  },
  {
    "name": "Upright Row",
    "category": "Shoulders",
    "equipment": "Dumbbell",
    "type": "weight",
    "image": "uprightrowdb.png",
    "image_detail": "uprightrowdb-detail.jpg",
    "description": [
      "Dumbbell upright rows offer an alternative way to target the deltoids and upper traps.",
      "Hold a dumbbell in each hand with an overhand grip.",
      "Lift the dumbbells towards your chin, leading with your elbows, and keeping them close to your body.",
      "Lower the dumbbells back down with control."
    ]
  },
  {
    "name": "V Up",
    "category": "Core",
    "equipment": "",
    "type": "weight",
    "image": "vup.png",
    "image_detail": "vup-detail.jpg",
    "description": [
      "V ups are a challenging core exercise that engage the upper and lower abdominals.",
      "Lie on your back with arms extended overhead and legs straight.",
      "Simultaneously lift your legs and upper body, reaching towards your feet to form a V shape.",
      "Lower your legs and torso back down in a controlled manner."
    ]
  },
  {
    "name": "Wrist Roller",
    "category": "Forearms",
    "equipment": "",
    "type": "weight",
    "image": "wristroller.png",
    "image_detail": "wristroller-detail.jpg",
    "description": [
      "Wrist rollers help strengthen the forearms and improve grip strength.",
      "Attach a weight to a rope and wrap it around a wrist roller handle.",
      "Hold the handle and roll the weight up by rotating your wrists.",
      "Slowly roll the weight back down using your wrist flexors."
    ]
  },
  {
    "name": "Zercher Squat",
    "category": "Legs",
    "equipment": "Barbell",
    "type": "weight",
    "image": "zerchersquatbb.png",
    "image_detail": "zerchersquatbb-detail.jpg",
    "description": [
      "Zercher squats target the lower body, particularly the quads, glutes, and core muscles.",
      "Hold a barbell in the crooks of your elbows with an underhand grip.",
      "Squat down by bending your hips and knees while keeping your back straight.",
      "Push through your heels to return to the standing position."
    ]
  }
]